{
    "0_FullStack Developer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nJob Title: Full stack EngineerLocation: Edison, NJ - HybridType: Contract Job description:~7-10 years of engineering experienceMaster's degree in Computer Science, Engineering, or a related technical field is a plusExperience deploying genAI applications is a plusExperience programming with Python and another language like Scala, C/C++, Java, C#, Go, or similar programming language.Experience with SQL or NoSQL databases (e.g., PostgreSQL, Snowflake, Redis, Amazon Redshift)Experience in deploying serverless data pipelines through containerization and terraform orchestrationExperience with Cloud platforms and services (AWS, Azure, Google Cloud Platform)Experience with DevOps, CI/CD, Git, Github ActionsExperience with modern ETL compute and workflow orchestration (e.g., Airflow, Luigy, Metaflow, Kubeflow, or any other)Strong computer science fundaments in data structures, algorithms, automated testing, object-oriented programming, performancecomplexity, and implications of computer architecture on software performance VDart Group, a global leader in technology, product, and talent management, empowers businesses with comprehensive solutions through our four distinct, industry-leading business units. With a diverse team of over 4,000 professionals across 13 countries, we deliver strong results across various industries, including Fortune 500 companies.Leveraging our deep expertise as a global provider of resources and solutions, we serve a wide range of industry verticals, including BFSI, Automotive, Healthcare, Mobility, Energy, Life Sciences, Manufacturing, Consumer Industries, and Technology.With over 16 years of experience, VDart has evolved to meet the needs of leading technology brands, placing and training more than 20,000 professionals and shaping the industry's future.Our continuous reinvention, providing resources for IT solutions and unique digital solutions, has positioned us as a top growth leader in digital talent management and technology consulting.Committed to \"People, Purpose, Planet,\" we prioritize social responsibility and sustainability, as evidenced by our EcoVadis Bronze Medal Certification and participation in the UN Global Compact.Our dedication to delivering strong results has earned us recognition as a trusted advisor for businesses seeking to drive innovation and growth, including many Fortune 500 companies.Join our network! Partner with VDart Group to leverage our global network, industry expertise, and proven track record with a diverse clientele.Employers have access to artificial intelligence language tools (“AI”) that help generate and enhance job descriptions and AI may have been used to create this description. The position description has been reviewed for accuracy and Dice believes it to correctly reflect the job opportunity.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "1_Java AWS Engineer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nWe are looking for Java AWS Engineer for our client in Mclean, VA / Richmond, VA Job Title: Java AWS Engineer Job Location: Mclean, VA / Richmond, VA Job Type: Contract Job : Responsibilities:Java+AWS.08+ years of IT experience in implementing Java 8, J2EE and related Java technologies, Good Knowledge in Java 17.Rest API.Must have Kafka and postgres db.Working and Hands-on experience on AWS Cloud experience AWS (ECS, EC2, S3, R53, RDS, IAM, LAMBDA, VPC, Fargate).Working and Hands on experience on Devops.Gained experience in Design Patterns.Experience in implementing Java Spring Boot, Spring Events.Excellent expertise in Java 8, Multithreading, Microservices.Proficiency in Advanced SQL.Good exposure and progressive experience working on AWS Cloud and integrations.Strong hands-on experience on Spring core and Spring JPA.Experienced in using GIT and Maven.Good with CI/CD - Jenkins, docker.Good written, verbal communication and documentation skills.Familiar with the Agile delivery process.Must be analytical and self-motivated.Work Effectively within a global team environment.Skills:Java, Spring boot, Spring Events, Rest API, Feign.AWS, Kafka, Jenkins, Docker, Postgres, Aurora.GraphQL/REST/GRPC.Employers have access to artificial intelligence language tools (“AI”) that help generate and enhance job descriptions and AI may have been used to create this description. The position description has been reviewed for accuracy and Dice believes it to correctly reflect the job opportunity.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "2_Lead Analytics Engineer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\n100% Remote, Hypergrowth Analytics SaaS, Equity part of total compensationThis Jobot Job is hosted by: Duran WorkmanAre you a fit? Easy Apply now by clicking the \"Apply Now\" button and sending us your resume.Salary: $150,000 - $175,000 per yearA bit about us:Our company is looking for a seasoned and dynamic Lead Analytics Engineer to join our innovative and fast-paced technology team. The successful candidate will be a key player in the design, creation, deployment, and maintenance of our analytics infrastructure. This role is vital to our organization as it directly influences our ability to make data-driven decisions. The position requires a deep understanding of modern data architecture, API, DBT, Snowflake, and Python. By joining our team, you will be part of a collaborative environment where your expertise will be valued and your innovative ideas will help shape the future of our company.Why join us?Innovative Technology100% Remote teamsGlobal presenceGreat total rewards package w/ EquityJob DetailsResponsibilities:Lead and manage the development and execution of an analytics platform that supports our business intelligence and data science teams.Collaborate with cross-functional teams to understand their data needs and translate them into technical requirements.Design and implement data models, data collection systems, data analytics, and other strategies that optimize statistical efficiency and quality.Develop and maintain scalable data pipelines and build out new API integrations to support continuing increases in data volume and complexity.Collaborate with data analysts and data scientists to build and optimize 'big data' pipelines, architectures, and data sets.Utilize DBT to transform data in our warehouse and ensure data is ready for analysis.Use Snowflake to manage, store, and analyze data, ensuring it is available to stakeholders in a timely manner.Drive the collection of new data and the refinement of existing data sources.Develop processes and tools to monitor and analyze model performance and data accuracy.Qualifications:Bachelor's degree in Computer Science, Engineering, Mathematics, or a related field.Minimum of 5 years of experience in a data engineering role with a proven track record of successful data platform implementations.Proficiency with Python, API, DBT, and Snowflake.Experience with data architecture, data modeling, schema design, and software development.Strong understanding of analytics and data platforms in the cloud (AWS, Google Cloud Platform, Azure).Strong project management and organizational skills.Excellent problem-solving and analytical skills, with the ability to create sophisticated solutions to complex problems.Strong communication skills, with the ability to explain complex technical concepts to non-technical stakeholders.Ability to work independently and as part of a team, on multiple projects simultaneously.Experience with machine learning algorithms and statistical modeling techniques is a plus.If you are a driven, results-oriented individual with a passion for data and analytics, we would love to hear from you. This is a fantastic opportunity to play a pivotal role in a fast-growing company, where your contributions will have a direct impact on our strategic decisions and our success. Apply today!Interested in hearing more? Easy Apply now by clicking the \"Apply Now\" button.Employers have access to artificial intelligence language tools (“AI”) that help generate and enhance job descriptions and AI may have been used to create this description. The position description has been reviewed for accuracy and Dice believes it to correctly reflect the job opportunity.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "3_Devops Engineer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nThis company provides a global payments software offering that has grown consistently over the last decade. Great company with vertical growth opportunity!This Jobot Job is hosted by: Alex DickinsonAre you a fit? Easy Apply now by clicking the \"Apply Now\" button and sending us your resume.Salary: $120,000 - $165,000 per yearA bit about us:This company is a modern software product firm that services clients all across the US. They have a very mature and modern IT infrastructure posture. Their current team is looking for a Devops engineer functioning in a .NET environment with cloud experience.Why join us?Competitive Base Salary - $120-155kQuarterly bonus plan401k with matchGym reimbursementWFH optionsAccelerated Career Growth!Job DetailsBuilding, configuration, deployment, and management of high volume, highly available .Net applicationsWindows Server/IIS deployment, configuration, and administrationKubernetes (AKS) deployment, configuration, and administrationAzure DevOpsMonolithic architectureTerraformOctopus DeployGitPowershell abilitiesSolid understanding of core concepts: DNS, HTTP/HTTPS, Load-Balancing, TCP/IP routing and switchingInterested in hearing more? Easy Apply now by clicking the \"Apply Now\" button.Employers have access to artificial intelligence language tools (“AI”) that help generate and enhance job descriptions and AI may have been used to create this description. The position description has been reviewed for accuracy and Dice believes it to correctly reflect the job opportunity.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "4_Senior Azure DevOps Engineer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\n:Seeking Senior Azure DevOps Engineer with experience working with cloud platforms and has a passion for automation and developing DevOps best practices. This person will drive DevOps automation and containerization strategies that align with DevOps principles and standards. DevOps engineer will collaborate with Product owners, developers, cloud engineers, DevOps engineers and operations to plan, design, test and deliver pipelines and infrastructure using Continuous Integration/Continuous Delivery (CI/CD) model.This position is eligible for the TalentQuest employee referral program. If an employee referred you for this job, please apply using the system-generated link that was sent to you.Responsibilities:Hands on automation skills designing, building, and troubleshooting CI/CD pipelines and Infrastructure as Code of enterprise applicationsBuild and support highly available CICD tools for pipelines and related integrationsDesign, build, and implement reusable YAML pipelines in Azure DevOps while adhering to best practicesPerform analysis of DevOps practices, identify gaps and impediments for continuous integration and deliveryEngage with information Security and augment the CI/CD framework with DevSecOps and standardized security tools and controlsDevelop and apply quality controls and gates to the build, test, and deploy process while establishing Definition of Ready and Definition of Done to ensure quality of deliveryBe a member of Center of Excellence for DevOps practices and develop policies, standards, guidelines, governance for both CI/CD operations and for work of developersProvide guidance, coaching, training on build, test, and release management best practicesCollaborate on and provide input into the CICD roadmap, identify gaps and dependenciesOnboard agile product teams to the CICD framework and perform DevOps health assessment on pipelines, identify gaps and execute recommendationsWork directly with business leadership to understand data requirements; propose and develop solutions that enable effective decision-making and drives business objectivesPerform other duties as assignedQualifications:A Bachelor's Degree in Computer Applications, Computer Science, Engineering, related field or equivalent experience5+ years hands on experience with Microsoft Azure or similar Cloud native offerings5+ years experience in creating continuous integration and delivery pipelines leveraging cloud native architectures on Microsoft Azure Cloud5+ years' Experience with agile delivery, SAFe, and DevOps frameworks5+ years' Experience with Azure DevOps Tools for plan, build, test, release and monitorExperience with Docker, Kubernetes, PowerShell scripting, Bash, YAML, Json, GIT, Rest API, and Azure Resource Management (ARM) templatesExperience with Git flow branching strategyHands on experience with implementing standards and best practices for the CI/CD frameworkKnowledge of security scanning/monitoring tools and integration with pipelineExtensive experience with scripting and debugging on Linux and Windows environmentsUnderstanding of Test Automation tools and scripts to facilitate Test Driven DevelopmentExperience with Automated Change Management using modernized solutions like ServiceNowDesired:Microsoft Certified: Azure Solutions Architect Expert or Azure DevOps Engineer Expert or Azure Developer AssociateExperience with Dynamics CRM platformExperience with Microservices deployment and release managementDemonstrated understanding of ADLS, ADF, Databricks, and SQL is a plusDemonstrated experience in Microsoft Dynamics 365 customization, configuration, deployment, and usage (experience migrating Dynamics from environment to environment is a plus)Experience using Azure DevOps REST API to enhance DevOps practicesHours: Monday - Friday, 8:00AM - 4:30PMLocation: 820 Follin Lane, Vienna, VA 22180 | 5550 Heritage Oaks Dr. Pensacola, FL 32526 | 141 Security Dr. Winchester, VA 22602 | RemoteJob postings are subject to close early or extend out longer than the anticipated closing date at the hiring team's discretion based on qualified applicant volume.About Us:Navy Federal provides much more than a job. We provide a meaningful career experience, including a culture that is energized, engaged and committed; and fierce appreciation for our teams, who are rewarded with highly competitive pay and generous benefits and perks.Best Companies for Latinos to Work for 2024Computerworld Best Places to Work in ITForbes 2024 America's Best Large EmployersForbes 2023 The Best Employers for New GradsFortune Best Workplaces for Millennials 2023Fortune Best Workplaces for Women 2023Fortune 100 Best Companies to Work For 2024Military Times 2023 Best for Vets EmployersNewsweek Most Loved WorkplacesRipplematch Campus Forward Award - Excellence in Early Career HiringYello and WayUp Top 100 Internship ProgramsFrom Fortune. 2024 Fortune Media IP Limited. All rights reserved. Used under license. Fortune and Fortune Media IP Limited are not affiliated with, and do not endorse products or services of, Navy Federal Credit Union.Equal Employment Opportunity: Navy Federal values, celebrates, and enacts diversity in the workplace. Navy Federal takes affirmative action to employ and advance in employment qualified individuals with disabilities, disabled veterans, Armed Forces service medal veterans, recently separated veterans, and other protected veterans. EOE/AA/M/F/Veteran/Disability EOE/AA/M/F/Veteran/DisabilityHybrid Workplace: Navy Federal Credit Union is a hybrid workplace, and details will be discussed during your interview process.Disclaimers: Navy Federal reserves the right to fill this role at a higher/lower grade level based on business need. An assessment may be required to compete for this position. Job postings are subject to close early or extend out longer than the anticipated closing date at the hiring team's discretion based on qualified applicant volume. Navy Federal Credit Union assesses market data to establish salary ranges that enable us to remain competitive. You are paid within the salary range, based on your experience, location and market position.Bank Secrecy Act: Remains cognizant of and adheres to Navy Federal policies and procedures, and regulations pertaining to the Bank Secrecy Act.Navy Federal Credit Union\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "5_Oracle Fusion Cloud HCM Cloud Developer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nAre you looking for the next exciting project opportunity with a great company? Our professional recruiting staff at CC Pace is here to support you in every step of the process! We have been in business for nearly four decades and have deep roots in the Washington, DC, metro area. Our direct client relationships with companies in various industries and sizes help us find the right opportunity for our candidates. We offer competitive rates, healthcare & dental, 401k, FSA, LTD, lots of voluntary benefits, and tons of discount perks. Our team is standing by, ready to help you get started today!Description:Oracle Fusion Cloud HCM Cloud Developer is a technical role that provides project coordination technical expertise and contributes to the support, maintenance, and enhancement of Oracle HCM Cloud modules (Recruiting, Benefits, Time & Labor, Payroll, Profile Management, and Performance Management.) Experience in product personalization, data integration, data conversion, and reports development.This resource will serve as a technical expert to the business to manage the development of new system functionality and system upgrades. It must have experience working with at least two modules in Oracle HCM Cloud and demonstrated experience in identifying, creating, documenting, and implementing solutions that enhance business and system operations.This resource should have experience in Oracle HCM Cloud advanced tools such as OIC, HCM Extracts, Fast Formula, HDL, BI Publisher reports, OTBI reports, Redwood Page Composer, Page Configurator, REST APIs, SOAP, Webservices, Fast Formula, Oracle HCM Application Security.Responsibilities:To participate in Oracle HCM Cloud-related projects, production support, and testing efforts to ensure solutions meet user requirements.To participate, coordinate, and perform the functional/technical tasks related to the development lifecycle of projects, including requirements definition, analysis, fit/gap resolution, process design and implementation, functional design, configuration, testing, training, and validation.Perform research and analysis to troubleshoot system issues.Identify and analyze opportunities for new and improved processes, data, or technology. After considering best practices, alternatives, and implications, present recommendations.Stay current on Oracle's quarterly HCM upgrades/enhancements/improvements.Collaborate with end users and technical resources to build solutions.Responsible for ensuring thorough testing execution, including identifying comprehensive test cases, preparing test scripts and test plans, executing scripts, and documenting results.Ensure compliance with ETS standards and best practices.Work closely with the Business Analysts and HR Business teams to gather requirements for reports, interfaces, extensions, and integrations.Providing strong subject matter expertise to identify and translate business and system requirements into design artifacts and documents.Build the integrations for HCM touch points utilizing all available integration services (The primary focus for this role will be OIC- Oracle Integration Cloud).Collaborating with project and delivery managers to provide estimates and develop the overall implementation solution plan for area of expertise, interfacing and coordinating tasks with internal and external resources.Develop functional and technical design and documentation for Oracle Applications dependent data conversions, interfaces, custom reporting, and custom applications, including the use of documented revision control.Participate in designing, developing, and maintaining Conversions, Modifications/Customizations, and Interfaces to/from Oracle's Suite of Business Applications.Open, manage, and resolve Oracle Service Requests with Oracle Support.Experience/QualificationsBachelor's degree in information technology, Computer Science, or other related fieldMinimal 5 years experience with Oracle Cloud HCMExperience supporting Oracle HCM Cloud modules (HR-core, Recruiting, Benefits, Time & Labor, Payroll, Profile Management, and Performance Management).Proven experience gathering and analyzing data and creating functional documentation. Including business process flows, requirements documents, test plans, and test scripts.Proven experience testing and documenting results.Expertise with Oracle Applications, Cloud Infrastructure/Solutions, and experience in SQL (Oracle or MS SQL).Expertise in the knowledge of BI Publisher (BIP) and OTBI reports development, Interface development and troubleshooting, Application security roles, and Workflow.Hands-on experience configuring and implementing an enterprise integration architecture solution using OIC adapters (SOAP, REST, FTP, and other pre-built adapters) based on data mapping requirement.Understanding leveraging Oracle SHDL and HDL capabilities to import data into Oracle Fusion Cloud via OIC.Willing to learn a range of business or technical specialties based on business needs.Experience with Agile software development practices, including SAFe, Scrum, Azure DevOps, Peer Review, GitHub, and CI/CD.Excellent interpersonal, communication, and presentation skills.Demonstrated ability to convey complex information in a clear and concise manner.Proficiency in Microsoft applications, including Word, Excel, and Visio.Desired Qualifications and Education Requirements:Bachelor's degree in information technology, Computer Science, or other related field.Knowledge of banking/financial industry trends, products, and services (desired).Technical certifications for Oracle Cloud HCM and Oracle Cloud Infrastructure (desired).An Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against based on disability. EEO IS THE LAW CC Pace invites any applicant and/or employee to review the Company s written Affirmative Action Plan. This plan is available for inspection upon request. If you are an individual with a disability and would like to request a reasonable accommodation as part of the employment selection process, please contact us.CC Pace\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "6_Cloud Infrastructure-as-Code Engineer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nJob Family: Systems EngineeringTravel Required: Up to 10%Clearance Required: NoneGuidehouse is seeking a Cloud Infrastructure-as-Code Engineer to be part of its central Solution Engineering and Architecture Services (SEAS) group in the office of the CTO. This role requires someone comfortable writing code who can both implement and help set standards and best practices to automate creation of cloud resources in a complex environment.This engineering professional will be focused on Infrastructure as Code, GitOps, and Security/Risk techniques necessary to build successful (minimal risk) solutions for large commercial enterprises and public sector customers. The engineer will be focused on re-usable patterns for improving the consistency, safety and operations of modern cloud driven architectures. Partnering with the IT Architecture and IT Security teams, this leader will build highly secure and repeatable solutions from re-usable components that will be used in proposals and as delivery structures to accelerate the delivery. Partnering with segments to build novel solutions, as well as harvesting successful solutions into a common catalog.What You Will Do:Architect and build infrastructure, security and operational solutions to fulfill project/solution requirements by using GitOps (Terraform, GitHub, Kubernetes).Create, design, and implement novel solutions and refactor/harvest existing solutions to maintain currency and improve re-use.Maintain legacy solutions including re-factoring, updates/upgrades and currency with modern CI/CD techniques with an eye toward security and risk.Integrate external software libraries and APIs into existing projects as well as software/services from partners.Commit changes into git repositories, open Pull Requests, and review others code.Administer various flavors of Linux running in the public cloud (Azure & AWS) environments.Optimize and improve analytics environments such as Posit Workbench and Posit Connect.Working knowledge of ServiceNow, JIRA, and GitHub.What You Will Need:Ability to obtain a National Security Clearance or a U.S. Federal Government Public Trust.Bachelor's Degree and minimum 4-6 years of prior relevant experience OR 8 years of relevant industry experience.4+ years of experience in a Developer, Software Engineering or Cloud Infrastructure Engineering (or similar) role.Working knowledge of Terraform and other Infrastructure-as-Code tools.Working knowledge of Security principles, 12 Factor App design.Experience working in public cloud (specifically Azure or AWS).Ability to research, plan, organize, lead, and implement new processes or technologies.Experience in Agile CI/CD development.Demonstrated ability to apply policy driven frameworks to cloud deployments inclusive of micro-services (Kubernetes) alongside terraform or similar IaaC techniques.Strong knowledge of modern development languages with 5+ years experience in at least one (python, golang, javascript).Strong communications and leadership skills with a demonstrated ability to drive change internally and on client engagements.Ability to clearly articulate pros and cons of various technologies and platforms and architectural options, as well as being able to document use cases, solutions and recommendations.What Would Be Nice To Have:Experience configuring Helm charts, writing Terraform, administrating Azure and/or AWS, working in Docker.Have knowledge of containerization through Docker, Kubernetes, Ansible, etc.Experience building/maintaining Big Data analytics platforms.Experience working in version control platforms such as GitHub or Azure DevOps.Experience with agile management tools like Jira, GitHub Projects, or Azure DevOps.Cloud certifications (Azure or AWS) preferred.Comfort working in Linux environments.Client facing skills with the capability of facing off with a variable set of client stakeholders from SME s to key executives.The annual salary range for this position is $100,200.00-$150,200.00. Compensation decisions depend on a wide range of factors, including but not limited to skill sets, experience and training, security clearances, licensure and certifications, and other business and organizational needs.What We Offer:Guidehouse offers a comprehensive, total rewards package that includes competitive compensation and a flexible benefits package that reflects our commitment to creating a diverse and supportive workplace.Benefits include:Medical, Rx, Dental & Vision InsurancePersonal and Family Sick Time & Company Paid HolidaysPosition may be eligible for a discretionary variable incentive bonusParental Leave and Adoption Assistance401(k) Retirement PlanBasic Life & Supplemental LifeHealth Savings Account, Dental/Vision & Dependent Care Flexible Spending AccountsShort-Term & Long-Term DisabilityStudent Loan PayDownTuition Reimbursement, Personal Development & Learning OpportunitiesSkills Development & CertificationsEmployee Referral ProgramCorporate Sponsored Events & Community OutreachEmergency Back-Up Childcare ProgramMobility StipendAbout GuidehouseGuidehouse is an Equal Employment Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, national origin, ancestry, citizenship status, military status, protected veteran status, religion, creed, physical or mental disability, medical condition, marital status, sex, sexual orientation, gender, gender identity or expression, age, genetic information, or any other basis protected by law, ordinance, or regulation.Guidehouse will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable law or ordinance including the Fair Chance Ordinance of Los Angeles and San Francisco.If you have visited our website for information about employment opportunities, or to apply for a position, and you require an accommodation, please contact Guidehouse Recruiting at 1-571-633-1711 or via email at . All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodation.Guidehouse does not accept unsolicited resumes through or from search firms or staffing agencies. All unsolicited resumes will be considered the property of Guidehouse and Guidehouse will not be obligated to pay a placement fee.Dovel Technologies\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "7_DevOps Engineer in Plano, TX": "Kevin Mathew,\nArthur Grand Technologies\nteamkevin@arthurgrand.com\nReply to: teamkevin@arthurgrand.com\nTitle: DevOps EngineerLocation: Plano, TX Job Description:Excellent working experience in CI/CD to Setup CI/CD pipeline to achieve fully automated CI/CD process.Troubleshoot and rectify build pipeline issues.Schedule automated build and deployment and execute ad-hoc build request by AD teamHands-on knowledge of Bit-bucket, GIT commands and branching strategies. Other Skills:Knowledge of Unix commands required for day to day operations and troubleshooting.Scripting knowledge for automation.Knowledge of webapps (weblogic, Tomcat, Apache , IBM HTTP etc) and their troubleshooting.Working knowledge of schedulers ( control M, Autosys etc).SSL/TLS certificate management. Thanks & RegardsKevin Mathew | Associate Team Lead Arthur Grand Technologies IncSBA 8(a) Certified Minority Small Business | Certified Minority Business Enterprise by NMSDCArthur Grand Technologies is an Equal Opportunity Employer (including disability/vets)\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "8_Senior Software Developer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nResponsibilities for this PositionLocation: USA IA Home Office (IAHOME)Full Part/Time: Full timeJob Req: RQ178315Type of Requisition:RegularClearance Level Must Currently Possess:NoneClearance Level Must Be Able to Obtain:NoneSuitability:Public Trust/Other Required:OtherJob Family:Software DevelopmentJob Qualifications:Skills:JavaScript, Microservices Architecture, RESTful Web Services, Software Development, Spring BootCertifications:Experience:5 + years of related experienceUS Citizenship Required:YesJob Description:Senior Software Developers- Java, REST API'sSoftware Developers are an integral part of the team here at GDIT that supports our client. You will be directly working on building a new microservices-based solution to assist millions of students pursue the dream of higher education. This is an exciting opportunity creating a new cloud-based application while being a part of a DevSecOps integration. Your ability to develop in JAVA and create REST API's are just the skills we need to deliver this solution to our customer. Communication is important within our organization; we use the Scaled Agile Framework (SAFe) to empower our development team.Your day-to-day impact:Creating maintainable, adaptable, scalable, defect-free micro services based code using software development best practices and coding standards (i.e., software reuse, refactoring, continuous integration, test automation, secure development, and test driven development)Working as a member of a scrum team to develop, integrate, and deploy high quality reusable, testable, and efficient code including Microservices with Java, Spring Boot, and REST API'sDeveloping microservices that include RESTful services using Spring Framework (IoC, MVC, Transactions, Security, and Batch)Writing Unit Test frameworks (JUnit, Mocking frameworks), code coverage, and code review and integrating work with GitLabWorking within a SAFe environment that includes consistent leadership support, continued learning education, refining user stories, providing internal and customer demonstrations of developed codeContributing within a SAFe environment including the Daily scrum, Sprint Planning, Sprint Retrospectives, Backlog grooming, Sprint/System Demos, PI Planning, and Inspect & Adapt events.Required Skills/Experience:5+ of related experience in software developmentExperience with JAVA and developing/maintaining backend APIs.Knowledge of REST API, JSON.Experience using API test cases in SOAP UI, PostMan, or ReadyAPI.Experience with common web development frameworks (Angular, Docker, React, Spring, Node.js, jQuery, Microservice Design, etc.)Excellent interpersonal skills including courtesy, professionalism, and a cooperative attitudeExcellent written and verbal communications skillsBachelor's degree in Computer Science, Engineering, or related technical discipline, or the equivalent combination of education, technical training, or work/military experience.U.S. Citizen with existing or the ability to pass a Public Trust background investigationDesired Skills/Experience:Federal Student Aid systems experience preferred.Experience with Atlassian suite of tools (e.g., Jira, Confluence) or other issue/change tracking software.Experience with GitLab DevOps/CI/CD platform.Experience with an IDE such as eclipse.GDIT takes care of their employees. We are a team. You will be heard and treated fairly. Our people are our strength, and we are proud of what we can do. Our work has meaning and impact on the world around us, we invite you to be part of this change and look forward to the solutions you provide.The likely salary range for this position is $92,331 - $116,237. This is not, however, a guarantee of compensation or salary. Rather, salary will be set based on experience, geographic location and possibly contractual requirements and could fall outside of this range.Scheduled Weekly Hours:40Travel Required:Less than 10%Telecommuting Options:RemoteWork Location:Any Location / RemoteAdditional Work Locations:Total Rewards at GDIT:Our benefits package for all US-based employees includes a variety of medical plan options, some with Health Savings Accounts, dental plan options, a vision plan, and a 401(k) plan offering the ability to contribute both pre and post-tax dollars up to the IRS annual limits and receive a company match. To encourage work/life balance, GDIT offers employees full flex work weeks where possible and a variety of paid time off plans, including vacation, sick and personal time, holidays, paid parental, military, bereavement and jury duty leave. GDIT typically provides new employees with 15 days of paid leave per calendar year to be used for vacations, personal business, and illness and an additional 10 paid holidays per year. Paid leave and paid holidays are prorated based on the employee's date of hire. The GDIT Paid Family Leave program provides a total of up to 160 hours of paid leave in a rolling 12 month period for eligible employees. To ensure our employees are able to protect their income, other offerings such as short and long-term disability benefits, life, accidental death and dismemberment, personal accident, critical illness and business travel and accident insurance are provided or available. We regularly review our Total Rewards package to ensure our offerings are competitive and reflect what our employees have told us they value most.We are GDIT. A global technology and professional services company that delivers consulting, technology and mission services to every major agency across the U.S. government, defense and intelligence community. Our 30,000 experts extract the power of technology to create immediate value and deliver solutions at the edge of innovation. We operate across 30 countries worldwide, offering leading capabilities in digital modernization, AI/ML, Cloud, Cyber and application development. Together with our clients, we strive to create a safer, smarter world by harnessing the power of deep expertise and advanced technology.We connect people with the most impactful client missions, creating an unparalleled work experience that allows them to see their impact every day. We create opportunities for our people to lead and learn simultaneously. From securing our nation's most sensitive systems, to enabling digital transformation and cloud adoption, our people are the ones who make change real.GDIT is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other protected class. PI243143987\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "9_IAM Security Engineer || Fort Worth, TX || 12 Months || Skype or F2F || Hybrid": "Boby Chaudhary,\nTek Inspirations LLC\nboby.chaudhary@tekinspirations.com\nReply to: boby.chaudhary@tekinspirations.com\nHello,Hope You are Doing WellPlease check the below job description and let me know if you have any suitable candidate for the same:Job Description -Title: IAM Security EngineerLocation: Onsite for first 15 days than 50% remote (candidate needs to be local to Fort Worth, TX)Contract: 12 months + Visa: USC, GC1. MOI: 1st round video, 2nd round onsite technical in Fort Worth, TX 2. The candidate will be expected to be in the office the first 15 days after they are brought onboard to work directly with the team. After that they will be working remote at least 50 of the time. They will not be designing they will be helping us build migrate deploy and maintain with a focus on the Identity Management platforms/system. This is a hands-on engineer/developer position. Looking for:8 years of software design and development including at least 5 years of development experience with Identity and Access Management technologies 3 years of relevant hands-on technical management experience and 2 years of experience with cloud 3 years of design development and support experience with SailPoint IdentityIQ IIQ 8.x including Life Cycle Manager LCM and Compliance ManagerCM which includes hands on experience with the following SailPoint IdentityIQ components such as but not limited to Workflows Rules Connectors Security Policies Aggregation Jobs Roles: This engineering position would be responsible for the development deployment and support of Security Identity and Access Management solutions as directed by management and senior team members. Additionally this engineer will be responsible for troubleshooting and triaging issues monitoring system health deploying enhancements hot fixes and fix packs performing configuration changes in multiple environments and coordinating with key stakeholders from IT operations business teams and third party vendors. Must be able to assist with user identity administration and maintenance of user security roles and profiles. Must be able to provide technical guidance and possess the ability to compose articulate and present complex technical issues to peers management and clients to gain consensus and recommend and/or act to complete complex deployments.Certification Campaigns and Application Integration.Experience working in DevOps environment automation first mindset ability to leverage coding/scripting skills and working experience with APIs.Ability to compose articulate and present complex technical issues to both technicians and clients to gain consensus.Exposure to all and expert knowledge in three or more of the following technologies: Automated Provisioning Directory Services Application On-Boarding Password Management Re-certifications Access Requests Access Review Delegation Dynamic Organizations Role based Security Access Control Customer Identity Management. Fluency in more than one technology stack and expertise in several of the following: C C Java J2EE JSP Servlet EJB Application Client/Server LDAP RMI WAS Web Services WS-Security SAML HTML XML XSLT SOAP MQ Series LDAP / Active Directory Federation Protocols such as OpenID Knowledgeable in the following areas: Identity as a ServiceMutual Auth for Service -ServicePIM methodologies REST and REST Security Experience with DB2 SQL Server Oracle or another enterprise-class RDBMS Operating Systems like Windows AIX and Linux. SOX audit controls and applicability to IAM services architecture design and processes Java Application Interface Development and Object Models Enterprise Service Bus ESB technologies / JMS Advanced systems designCertifications is a plusHands on experience with IBM Security Identity Manager ISIM is a plus RegardsBoby ChaudharyIT RecruiterTEK Inspirations LLC : 13573 Tabasco Cat Trail, Frisco, TX 75035Email: boby.chaudhary@tekinspirations.comDisclaimer: If you are not interested in receiving our e-mails then please reply with a \"REMOVE\" in the subject line to remove@tekinspirations.com. And mention all the e-mail addresses to be removed with any e-mail addresses, which might be diverting the e-mails to you. We are sorry for the inconvenience.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "10_IAM Security Engineer || Fort Worth, TX  || 6 Months || F2F || Hybrid": "Boby Chaudhary,\nTek Inspirations LLC\nboby.chaudhary@tekinspirations.com\nReply to: boby.chaudhary@tekinspirations.com\nHello,Hope You are Doing WellPlease check the below job description and let me know if you have any suitable candidate for the same:Job Description -1. The technical interviews will be in person.2. The candidate will be expected to be in the office the first 15 days after they are brought onboard to work directly with the team. After that, they will be working remote at least 50% of the time. IAM Security Engineer 6+ months Contract to hire Hybrid - Fort Worth, TX (Must be local to DFW)US Citizen or Green card 8+ years of software design and development, including at least 5+ years of development experience with Identity and Access Management technologies, 3+ years of relevant hands-on technical management experience and 2+ years of experience with cloud 8+ years of software design and development, including at least 5+ years of development experience with Identity and Access Management technologies, 3+ years of relevant hands-on technical management experience and 2+ years of experience with cloud provider services (AWS or Azure). 3+ years of design, development and support experience with SailPoint IdentityIQ (IIQ 8.x) including Life Cycle Manager (LCM) and Compliance Manager(CM) which includes hands on experience with the following SailPoint IdentityIQ components such as but not limited to Workflows, Rules, Connectors, Security Policies, Aggregation Jobs, Roles, Certification Campaigns and Application Integration.This engineering position would be responsible for the development, deployment and support of Security Identity and Access Management solutions as directed by management and senior team members.Additionally, this engineer will be responsible for troubleshooting and triaging issues, monitoring system health, deploying enhancements, hot fixes and fix packs, performing configuration changes in multiple environments, and coordinating with key stakeholders from IT operations, business teams, and third party vendors.Must be able to assist with user identity administration and maintenance of user security roles and profiles.Must be able to provide technical guidance and possess the ability to compose, articulate and present complex technical issues to peers, management and clients to gain consensus and recommend and/or act to complete complex deployments.Preferred Technical Qualifications:Experience working in DevOps environment, automation first mindset, ability to leverage coding/scripting skills and working experience with APIs.Ability to compose, articulate and present complex technical issues to both technicians and clients to gain consensus.Exposure to all and expert knowledge in three or more of the following technologies: Automated Provisioning, Directory Services, Application On-Boarding, Password Management, Re-certifications, Access Requests, Access Review, Delegation, Dynamic Organizations, Role based Security & Access Control, Customer Identity Management.Fluency in more than one technology stack and expertise in several of the following: C, C++, Java, J2EE, JSP, Servlet, EJB, Application (Client/Server), LDAP, RMI, WAS, Web Services, WS-Security, SAML, HTML, XML, XSLT, SOAP, MQ Series, LDAP / Active Directory, Federation Protocols such as OpenIDKnowledgeable in the following areas:• Identity as a Service• Mutual Auth for Service -Service• PIM methodologies REST and REST Security• Experience with DB2, SQL Server, Oracle, or another enterprise-class RDBMS• Operating Systems like Windows, AIX, and Linux.• SOX audit controls and applicability to IAM services architecture, design, and processes• Java Application Interface Development and Object Models• Enterprise Service Bus (ESB) technologies / JMS Advanced systems design• Certifications is a plus• Hands on experience with IBM Security Identity Manager (ISIM) is a plusThis is a hands-on engineer/developer position. They will not be designing, they will be helping us build, migrate, deploy and maintain with a focus on the Identity Management platforms/system. Boby ChaudharyIT RecruiterTEK Inspirations LLC : 13573 Tabasco Cat Trail, Frisco, TX 75035Email: boby.chaudhary@tekinspirations.comDisclaimer: If you are not interested in receiving our e-mails then please reply with a \"REMOVE\" in the subject line to remove@tekinspirations.com. And mention all the e-mail addresses to be removed with any e-mail addresses, which might be diverting the e-mails to you. We are sorry for the inconvenience.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists."
}