{
    "0_only W2, Microsoft Azure Cloud Systems Architect": "priyanka verma,\nTriwave Solutions Inc\npriyanka@triwavesolutions.com\nReply to: priyanka@triwavesolutions.com\nPosition Title*Cloud Systems Architect (7/12)Position ResponsibilitiesJob Title: Cloud and System ArchitectJob Location: Tallahassee, FL (hybrid)Job Duration: 12-month contractJob Overview: Cloud and Systems Architect to play a key role in assisting IT in the oversight, management, and execution of cloud services and platforms to support infrastructure, applications, data, and other business needs.Design, upgrade, administer, test, and modify the virtual desktop infrastructure environment.Assist in ongoing modernization and migration efforts for applications, data, and infrastructure.Oversight and management of Microsoft 365 environments.Oversight and management of other Microsoft platforms and/or environments.Oversight and management of identity platforms.Oversight and management of a multi-cloud environment.Architect, design, facilitate, lead, coordinate, and direct technology initiatives on multiple fronts across a variety of disparate areas within the organization. This could include Infrastructure administration, application development, data management & analytics, cybersecurity, external hosting, identity and access management, infrastructure, network, security hardening, privacy, and compliance.Job Duties:Build and manage relationships in a matrixed environment.Recommend and assist with the building and hosting of complex application solutions.Understand, deploy, and manage Microsoft Azure and/or other cloud services.Understand, deploy, and manage Microsoft Power Platform.Find opportunities to refactor solutions to obtain better performance, cost, and efficiency.Enhance infrastructure, application, and system monitoring solutions to prioritize system uptime.Review, advise, and design based on risks, costs, benefits and impact on the enterprise business process and goals.Automate processes wherever possible.Create and manage Azure DevOps projects, git repositories, and pipelines.Troubleshoot issues brought forth by developers and other architects.Present to your peers on findings of new technologies, enterprise-wide issues, and enhancements you have made to better the mission.Required Experience: 2 – 3 years of strong professional experience as a Microsoft Azure cloud systems architect is required.5 - 8 years of professional experience in information systems engineering or another related field is required.2 - 3 years of experience in Enterprise Architecture is required.Strong analytical skills to determine an organization's needs, develop strategies to meet those needs, and evaluate effectiveness.Ability to categorize work, set priorities, and determine short and/or long-term goals and strategies to achieve them.Ability to troubleshoot and diagnose problems effectively regardless of technology platform.Able to easily convey knowledge to others.Proficiency in working in a fast-paced, complex, and dynamic business environment.In-depth knowledge of Microsoft Azure Services.In-depth knowledge of Microsoft Server products.In-depth knowledge of Linux (Redhat and Ubuntu).Strong grasp of IT infrastructure and application development technology and architectures.Knowledge of assessment and analytical process and practices.Skill in strategic planning.Skill in researching, compiling, and analyzing data to report findings and develop improvement solutions.Skill in system administration and hosting across a wide range of solutionsAbility to research, identify, and implement innovative solutions.Ability to communicate effectively; both verbally and written.Ability to establish and maintain effective working relationships.Ability to work independently and as a team.Preferred Experience:2 – 3 years of experience with other cloud providers, such as AWS or GCP is highly desired.5 years of professional experience supporting middleware such as API Management, IT Service Automation tools, and batch job services is highly desired.2 - 3 years of professional experience in administration of Microsoft software is highly desired.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "1_JD||AWS Engineer||Culver City CA": "vikas kumar,\nsynkriom\nvikas.kumar@synkriom.com\nReply to: vikas.kumar@synkriom.com\nRole name: AWS EngineerRole Description:AWS Cloud Enablement EngineerCompetencies:Digital : Amazon Web Service(AWS) Cloud ComputingExperience (Years):8-10Essential Skills:AWS Cloud Enablement EngineerDesirable Skills:AWS Cloud Enablement Engineer Keywords:AWS Cloud Enablement Engineer\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "2_DevOps Architect :: Remote": "Ekta Chaudhary,\nEpeople Technologies\nekta@epeopletech.com\nReply to: ekta@epeopletech.com\nTerraform Template creation Terraform module write upAWS Resources including Gateway, Lambda, Authentication patternHelm templatePython or Shell scripting, Bash scriptingPython developmentGithub, Github action includes Scans like Sonar, AppSec Branching strategyGitOpsPython API developmentExperience in DevOps Architecture design and strategy.how to deploy same authentication in Lambda and EKSServer less authentication services\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "3_Job Opportunity for Salesforce Commerce Cloud Technical Lead": "Gunadeep,\nAvance Consulting\ngunadeep.c@avanceservices.com\nReply to: gunadeep.c@avanceservices.com\nHello, Hope you are doing well...!This is GUNADEEP from AVANCE CONSULING, and I have a new job opening for you. Please have a look at the below job description, if interested please share your updated resume or feel free to contact me.Job Description:Title: Salesforce Commerce Cloud Technical Lead roleDuration: ContractLocation: RemotePlease find the JD below:8 to 10 years of hands-on development experienceMust understand eCommerce architecture, product, order, and inventory flows to create detailed designs, architectural documents, and develop solutions.Be able to support the full code review and release management for SFCC.Strong background in SFCC and SF OMS experience with eCommerce/Digital environment, Batch File Scripting, SQL, Java knowledge Should have worked on projects supporting SFCC implementation.Used DevOps such as Copado, Git, Flossum, etc.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "4_Very Urgent Job Opportunity of AWS LEAD (TECHNICAL LEAD) at Location- San Antonio, TX (Onsite) is shared with you": "Raghwendra Rao,\nIDC Technologies\nraghwendra.rao@idctechnologies.com\nReply to: raghwendra.rao@idctechnologies.com\nGreetings! This is Raghwendra from IDC Technologies, and I am writing to you regarding an excellent job opportunity that I have with one of IDC’s premier clients in San Antonio, TX (Onsite). I found your resume during my search for qualified candidates on the internet and would like to know if you would be interested in pursuing this opportunity. Please share your updated resume if interested. Job Title: AWS LEAD (TECHNICAL LEAD)Position Type: CTH Location: San Antonio, TX (Oniste)Min. Exp- 12 Years Mandatory Skillset: AWS Architecture, AWS Services-Lambda Functions, AWS EC2, AWS S3Bucket, AWS EKS, RDS, SQS, Dynamo DB, Terraform SNS/ SQS, Java/J2EE, SOA, API Integration, Docker/Container/ Kubernetes, IAASOverview:Looking for talented cloud Developer (Lead) responsible for developing design and architecture to support cross domain business capabilities. Candidate will focus on the intentional architecture and provide mentorship on emergent architecture to the technical teams. Candidate will have hands-on experience in cloud architectures (SaaS, PaaS, IaaS) and deep interest and experience in broad enterprise platforms and cloud patterns. Job Description:Participate in producing conceptual, solution and component-level architectures and associated artifacts. Develop cross domain business requirements reference architecture for transition and target state and contribute to the cloud related patterns and implementations. Develop common components for shared business capabilities with Standards and best practices. Develop the transition architecture using services offered by AWS and private cloud.Migrate legacy applications to AWS and private cloud. Hands on experience with AWS cloud networking including VPCs, Subnets, Security Groups, ACLs, Transit Gateways, ALB/NLB, Route53, ACM, API Gateway and related technologies.Understanding of networking processing, protocols, and standards - TCP/IP, UDP, DNS, HTTPHands on experience with security mechanisms including mTLS, x509, OpenID Connect, JWT/JWE, OAuth2, PEP/PDP, SAML, WS-Security, Basic Auth and ABAC/RBAC based policies.Hands on “code first” development of cloud configuration and components from the ground up using tools like Gitlab and TerraformStrong hands-on experience in one or more development languages including Java, python, Golang.Experience with Open Trace, AWS Cloud Watch, DataDog, Prometheus, ELK, Grafana, Hystrix,, App Dynamics, NetCool and other tools to ensure the cloud is operating as expected.Hands on experience with continuous delivery (CD) tooling including Jenkins, GitLab, Travis CI, GoCD and others.Hands on experience with Containers including tools like Docker, Kubernetes, ECS/ECR, and other related technologies and tools.Experience in explaining complex technology decisions and developing high trust relationships with stakeholders. Ability to develop target state architecture using services offered by AWS and private cloud and vision to develop the transition architecture. Ability to design patterns for moving legacy applications to AWS and private cloud. Hand on experience with common architecture patterns (microservices, event-driven, REST, NO SQL databases, Caches, etc.) and services offered by AWS (S3, EKS, Lambda, RDS, elastic search, etc.) Hands on experience addressing operational and non-functional concerns (e.g. scalability, performance, maintainability, load distribution, resilience and recovery, etc.) Experience with SAFe framework or other similar agile frameworks. Experience with Java, Kafka, Spring, Redis, Kubernetes, OpenShift and others. Guidewire experience is big plus.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "5_Hiring || Cloud Developer || Atlanta, GA Need a local candidateHybrid": "sakthivel,\nERPMark\nsakthivel@erpmark.com\nReply to: sakthivel@erpmark.com\nRole :Cloud DeveloperLocation : Atlanta, GA Need a local candidate HybridDuration : Long Term Note : Have to F2F interview JD: Strong AWS development with Python exp -Lambda, S3, Athena,Glue, DynamoDB, Event bridge\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "6_AWS Cloud Enablement Engineer": "Pradeep,\nScalable Systems\npradeep.sharma@scalable-systems.com\nReply to: pradeep.sharma@scalable-systems.com\nHi,Greetings of the day! I have an urgent requirement below, please go through JD and let me know if you are comfortable or have any profile. Kindly revert me back with your updated resume as well. Job Title: AWS Cloud Enablement Engineer Location: Culver City, CA (Work from Office)Duration: Long Term Contract Key Responsibilities:AWS Cloud Enablement EngineerAmazon Web Service(AWS)Cloud Computing Thanks & Regards, Pradeep SharmaEmail: pradeep.sharma@scalable-systems.com\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "7_Senior DevOps Engineer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nLoopNet - Senior DevOps EngineerJob Overview CoStar Group (NASDAQ: CSGP) is a leading global provider of commercial and residential real estate information, analytics, and online marketplaces. Included in the S&P 500 Index and the NASDAQ 100, CoStar Group is on a mission to digitize the world's real estate, empowering all people to discover properties, insights and connections that improve their businesses and lives. We have been living and breathing the world of real estate information and online marketplaces for over 35 years, giving us the perspective to create truly unique and valuable offerings to our customers. We've continually refined, transformed and perfected our approach to our business, creating a language that has become standard in our industry, for our customers, and even our competitors. We continue that effort today and are always working to improve and drive innovation. This is how we deliver for our customers, our employees, and investors. By equipping the brightest minds with the best resources available, we provide an invaluable edge in real estate. We are currently seeking an accomplished Senior DevOps Engineer to join our team, while supporting our multiple software products and brands across the organization, such as LoopNet , Apartments.com , Homes.com , and Ten-X .This position is located in Irvine and offers 2 days remote per week. ResponsibilitiesGrow the team's experiences and skillset through knowledge sharing and by having proactive and team-centered attitude.Automate and leverage DevOps principles, always striving for operational excellence with infrastructure-as-code mentality.Utilize cutting-edge technology to improve our services and processes.Manage enterprise level web applications.Collaborate with development and operations team to design and build scalable and secure infrastructure.Practice continuous integration/continuous delivery (CI/CD) using latest DevOps tools and innovative methods.Ensure the health and uptime of critical systems and applications with pro-active monitoring and metrics analysis.Strong troubleshooting skills (application, network, systems, infrastructure) with ability to multi-task and context switch.Good communication skills, expresses oneself clearly both verbally and in writing.Participate in a weekly on-call rotation once on-boarded.Basic QualificationsBachelor's Degree required from an accredited, not-for-profit university or college.A track record of commitment to prior employers.5+ years' experience with managing heavy web traffic sitesIaC (Terraform, Cloudformation)CI/CD (Azure DevOps)Kubernetes / EKSAWS (EC2, ALBs, S3, IAM, ASG, Lambda, Dynamo, Step Function, Elasticache, OpenSearch, etc.)Enterprise monitoring tools in areas of APM, system vitals, synthetics, and RUM (DataDog, AppDynamics, Prometheus, Icinga).Scripting language (PowerShell, Bash, YAML)Configuration management (e.g., Chef, Ansible)Experience with configuring CDN for performance caching and global traffic management.Preferred Qualifications And SkillsSome developer background with either Java, C#, Python, NodeJSFamiliar with load balancing technologies such as F5 LTMs, including management of VIPs, pools, nodes, iRule authoring, SSL offloading.SQL or No SQL databasesServer-less architecture methodologiesFamiliarity with PCI compliance and remediationAgile methodologies and working on short sprint cyclesWhat's in it for You When you join CoStar Group, you'll experience a collaborative and innovative culture working alongside the best and brightest to empower our people and customers to succeed.We offer you generous compensation and performance-based incentives. CoStar Group also invests in your professional and academic growth with internal training, tuition reimbursement, and an inter-office exchange program.Our benefits package includes (but is not limited to):Comprehensive healthcare coverage: Medical / Vision / Dental / Prescription DrugLife, legal, and supplementary insuranceVirtual and in person mental health counseling services for individuals and familyCommuter and parking benefits401(K) retirement plan with matching contributionsEmployee stock purchase planPaid time offTuition reimbursementOn-site fitness center and/or reimbursed fitness center membership costs (location dependent), with yoga studio, Pelotons, personal training, group exercise classesAccess to CoStar Group's Diversity, Equity, & Inclusion Employee Resource GroupsComplimentary gourmet coffee, tea, hot chocolate, fresh fruit, and other healthy snacksWe welcome all qualified candidates who are currently eligible to work full-time in the United States to apply. However, please note that CoStar Group is not able to provide visa sponsorship for this position.This position offers a base salary of $124,000 - $211,000, based on relevant skills and experience and includes a generous benefits plan.#LI-IZ1 #LI-HybridCoStar Group is an Equal Employment Opportunity Employer; we maintain a drug-free workplace and perform pre-employment substance abuse testingEmployers have access to artificial intelligence language tools (“AI”) that help generate and enhance job descriptions and AI may have been used to create this description. The position description has been reviewed for accuracy and Dice believes it to correctly reflect the job opportunity.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "8_Urgent Need: Azure Architect with EventHub, Snowflake and Cosmos DB, 100% Remote": "SAPNA,\nITECS\nsapna@itecsus.com\nReply to: sapna@itecsus.com\nUrgent need from Infocepts. Only US Citizens. Phone + Video interview.100% Remote from US location. Primary Skills: Technologies/Tools: Azure, EventHub, Snowflake, Cosmos DB, Managed Airflow, API Gateway & DBT Job Title: Azure Architect with EventHub, Snowflake and Cosmos DBWork Location: Onshore in USA – 100% Remote Purpose of the Position: Purpose of this role is to design and build data architecture for a migration project. Major responsibilities under this role would be to create high level and low level design for data integration framework, translate the business requirements into technical prototypes, help developers in developing the data integration pipelines, perform peer reviews of the code, own the technical delivery of the DI part from inception to the deployment. Also own the technical consultation for existing or new clients during initial phase of any initiative and help in proposals and pre-sales initiatives. Must Have Technical Experience:At least 12 years of IT experience; Minimum 5 years of experience on AzureMust have minimum 5+ years of experience in implementing and managing Azure Cloud components.Expertise in Python and SQL best practicesExperience in data and analytics domainKnowledge of integrating Azure Active Directory with other servicesIn-depth experience of key Azure services for data integration, BI and processing services including but not limited to Azure HDInsight, Azure Databricks, Azure Portal, Log Analytics, Azure Data Factory, , Azure Search, Azure Functions, Azure Stream Analytics, Managed Airflow and Azure Event Hub.Experience in Azure cosmos DB over PostgreSQL, mongo dB and live streaming with Azure EventHub.Experience on Azure functions with Python language.Experience in migration of on-prem applications and data analytics workload to Azure cloud. Experience in designing Azure cloud architecture and operationalizing solutions around monitoring, alerting, logging etc.Working knowledge on Architecture design, Modelling, prototyping, and benchmarking of DataStore/ EDW solutions.Knowledge of variety of advanced architecture, tools, and concepts across all layers of modern distributed technology stack covering the big data ecosystem.Knowledge of Azure storage services such as Azure storage account, Azure Cosmos DB, Azure Time Series Insights, Redis Cache, SQL Databases, Table StorageExperience with programming languages such as PythonExperience in enabling DevOps automation for Azure with appropriate security and privacy considerations.Knowledge of configuring and provisioning networks and infrastructure in cloudGood to have knowledge of Big Data ecosystems such as Hadoop / Hive, HDFS, Spark, YARN and others.Good to have Snowflake, Scala, and Java experienceGood to have Technical Experience:Pre-sales experience will be an added advantage.Any BI experienceExperience in any other cloud technologies like AWS, ALI, GCP.Snowflake, DBT, Scala and JavaTechnologies/Tools: Azure, EventHub, Snowflake, Cosmos DB, Managed Airflow, API Gateway & DBTQualifications:Bachelor’s degree in computer science, engineering, or related field (master’s degree is a plus)Demonstrated continued learning through one or more technical certifications or related methods. ---------------------------------------------------------------------------------------------------------------------------Please follow the submission format table provided and ensure all required information is included with each submission with resume. Incomplete submissions will be disqualified. Candidate Legal Name (As per Documents) Summary Year of experience in each skillset: Email Address Phone Number Work Authorization Current Location For non-local, Relocation (Yes/No) Pay Rate Current working status Reason for change LinkedIn Profile Availability for Interview (Please provide 03 time slots) Availability for Joining the project\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "9_Devops Engineer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nThis company provides a global payments software offering that has grown consistently over the last decade. Great company with vertical growth opportunity!This Jobot Job is hosted by: Alex DickinsonAre you a fit? Easy Apply now by clicking the \"Apply Now\" button and sending us your resume.Salary: $120,000 - $165,000 per yearA bit about us:This company is a modern software product firm that services clients all across the US. They have a very mature and modern IT infrastructure posture. Their current team is looking for a Devops engineer functioning in a .NET environment with cloud experience.Why join us?Competitive Base Salary - $120-155kQuarterly bonus plan401k with matchGym reimbursementWFH optionsAccelerated Career Growth!Job DetailsBuilding, configuration, deployment, and management of high volume, highly available .Net applicationsWindows Server/IIS deployment, configuration, and administrationKubernetes (AKS) deployment, configuration, and administrationAzure DevOpsMonolithic architectureTerraformOctopus DeployGitPowershell abilitiesSolid understanding of core concepts: DNS, HTTP/HTTPS, Load-Balancing, TCP/IP routing and switchingInterested in hearing more? Easy Apply now by clicking the \"Apply Now\" button.Employers have access to artificial intelligence language tools (“AI”) that help generate and enhance job descriptions and AI may have been used to create this description. The position description has been reviewed for accuracy and Dice believes it to correctly reflect the job opportunity.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists."
}