{
    "0_Need: Java Backend Developer- Lead: Philadelphia, PA (Need Only Locals)": "Satnam Singh,\nSPAR Information Systems\nsatnam.singh@sparinfosys.com\nReply to: satnam.singh@sparinfosys.com\nHello All,Hope you are doing great!!Please go through the job description and let me know your interest.Role: Java Backend Developer/ LeadLocation: Philadelphia, PA (100% Onsite from Day 1) (Need Only Locals)Duration: Long Term ContractJob Description:Mandatory Skills Java, Spring Boot, Kubernetes, Oracle/Postgres, MicroservicesOptional Skills AWS, DevOps, Angular JS/ReactOverview of the Role:• Collaborates with project customers to identify product and technical requirements. Conducts analysis to determine integration needs.• Designs new software and web applications, supports applications under development and customizes current applications. Assists with the software update process for existing applications and roll-outs of software releases.• Participates in training representatives and operations staff on internally developed software applications.• Researches, writes and edits documentation and technical requirements, including software designs, evaluation plans, test results, technical manuals and formal recommendations and reports.• Monitors and evaluates competitive applications and products. Reviews literature, patents and current practices relevant to the solution of assigned projects.• Provides technical leadership throughout the design process and guidance with regards to practices, procedures and techniques. Serves as a guide and mentor for junior-level Software Development Engineers.• Works with Quality Assurance team to determine if applications fit specification and technical requirements.• Displays in-depth knowledge of engineering methodologies, concepts, skills and their application in the area of specified engineering specialty.• Displays in-depth knowledge of and ability to apply, process design and redesign skills. Presents and defends architectural, design and technical choices to internal audiences.• Displays knowledge of and ability to apply, project management skills.• Consistent exercise of independent judgment and discretion in matters of significance.• Regular, consistent and punctual attendance. Must be able to work nights and weekends, variable schedule(s) and overtime as necessary.• Other duties and responsibilities as assigned.Mandatory Skills• Java• Spring framework• Spring Boot• Kubernetes• Oracle or Postgres database• Microservices implementationNice To Have Skills• Web apps• Angular JS or React• Concourse and DevOps practices is a plus• Scripting• AWS ExperienceThanks & Regards,Satnam SinghDirect: 201 623 3660Email : Satnam.singh@sparinfosys.com\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "2_HIRING NOW::Python Full Stack Architect::NYC,NY": "Sam,\nAdventa Tech Inc\nslenka@vyzeinc.com\nReply to: slenka@vyzeinc.com\nJob Description -Title: Python Full Stack Architect Onsite -NYC, NY Contract to hire Visa: USC & GC JD: Mandatory skills : Architect- Python Lamba - React - Dynamo DB - Vulnerability - Mix - AWS - Backend - Secuirty Healthcare back ground must Senior Full Stack Python & React Developer to lead the design, development, and implementation of scalable web applications and strong expertise in App Security. strong background in both Python with AWS lambda and React, with a passion for delivering high- Quality software solutions that meet business requirements. This role offers the opportunity to work on exciting projects, collaborate with cross-functional teams, and drive innovation in a fast-paced environment. Key Responsibilities: 1.Design, develop, and maintain robust and scalable web applications using Python with serverless architecture and React. 2.Collaborate with product managers, designers, and other stakeholders to define project requirements and deliverables. 3.Strong understanding of security principles, protocols, and standards (e.g., OWASP, TLS/SSL, encryption). 4.Lead technical discussions and provide guidance to junior developers on best practices and code quality. 5.Participate in code reviews to ensure adherence to coding standards, scalability, and performance requirements. 6.Identify and address technical debt, performance bottlenecks, and other software issues. 7.Stay current with emerging technologies and trends in web development, and propose new solutions and frameworks to improve efficiency and productivity. 8.Work closely with QA engineers to ensure the quality and reliability of the software through comprehensive testing and validation. 9.Provide technical support and troubleshooting for production issues as needed. Qualifications: 1.Bachelor's degree in Computer Science, Engineering, or related field 2.5+ years of professional experience in software development, with a focus on full stack web development. 3.Proficiency in Python, AWS Lambda for backend development. 4.Proficiency in secure coding practices and vulnerability management. 5.Strong experience with React.js and related libraries/tools (Redux, Hooks) for frontend development. 6.Solid understanding of RESTful APIs, JSON/XML, and web services integration. 7.Experience with database design and optimization (SQL Server/ PostgreSQL). 8.Familiarity with modern web technologies such as HTML5, CSS3, JavaScript ES6+, and responsive design principles. 9.Experience with Agile/Scrum methodologies and version control systems (Git, SVN, etc.). 10.Excellent problem-solving skills and attention to detail 11.Strong communication and interpersonal skills, with the ability to collaborate effectively in a team environment. Preferred Qualifications: 1.Familiarity with AWS services such as API Gateway, DynamoDB, and S3 2.Familiarity with DevOps practices and tools (Jenkins, Azure DevOps) 3.Familiarity with unit testing frameworks like Behave, Cucumber, Jest, etc., 4.Experience with security testing tools and techniques (e.g., penetration testing, static code analysis) 5.Familiarity with security compliance frameworks (e.g., GDPR, HIPAA, SOC 2). 6.Experience with AWS security services such as IAM, KMS, and AWS Config.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "3_Urgent Profile Needed - AWS  Senior Cloud &amp; DevOps Engineer (Java)  -  Dallas, Texas- Onsite": "John Joseph,\nIDC Technologies\njohn.joseph@idctechnologies.com\nReply to: john.joseph@idctechnologies.com\nHI, Hope you are doing well. We have an urgent opening for the position of “AWS Senior Cloud & DevOps Engineer (Java)- Dallas, Texas- Onsite” Contract position for our clients, kindly Check the below job description and let me know your interest. Job Description: Job Title : AWS Senior Cloud & DevOps Engineer (Java)Experience : 5 to 20 yearsLocation : Dallas, Texas We are looking for an AWS Senior Cloud & DevOps Engineer (Java) who will have hands-on experience with Jenkins Jobs, Ansible scripting, Core Java, Unix, Shell Scripting, Python, Application Deployment, DevOps practices, and monitoring tools. This role requires collaboration with various teams to implement load balancer changes, firewall rules, and certificates, and ensure the optimal performance and security of our applications.Responsibilities:Proven experience in a similar role with extensive troubleshooting expertise.Strong experience with Jenkins Jobs, Ansible scripting, and DevOps practices.Hands-on experience with monitoring tools like New Relic, Grafana, and Kibana.Experience with Kubernetes, Rabbit MQ, IBM MQ, and WebSphere.Experience with Apigee and managing certificates.Familiarity with network security principles and firewall rule implementation.Ability to manage and renew certificates across various components.Proficiency in Core Java, Unix, Shell Scripting, Python, Application Deployment, and DevOps.Familiarity with the Pega platform.AWS cloud experience, including provisioning EC2 instances and managing EKS clusters.Excellent problem-solving skills and ability to work collaboratively with cross-functional teams.Conduct root cause analysis and work with partners and COTTs vendors for implementation of production fixes.Troubleshoot degradation and performance issues.Implement load balancer changes in collaboration with various teams.Implement firewall rules by working closely with network teams.Manage and renew certificates across Applications, Load Balancers, DB, MQ, Apigee, etc.Hands-on experience with Jenkins Jobs and Ansible scripting.Deploy and manage applications using Core Java, Unix, Shell Scripting, Python, DevOps, and related technologies.Utilize monitoring tools like New Relic, Grafana, and Kibana to ensure system performance and reliability.Work with the Pega platform to support and enhance system capabilities.Provision and manage AWS cloud resources, including EC2 instances and EKS clusters.Collaborate with teams to ensure effective deployment, monitoring, and scaling of applications in Kubernetes environments.Manage messaging queues with Rabbit MQ and IBM MQ.Utilize WebSphere for application server management.Qualification: Bachelor's degree or equivalent combination of education and experience\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "5_DevOps Architect :: Remote": "Ekta Chaudhary,\nEpeople Technologies\nekta@epeopletech.com\nReply to: ekta@epeopletech.com\nTerraform Template creation Terraform module write upAWS Resources including Gateway, Lambda, Authentication patternHelm templatePython or Shell scripting, Bash scriptingPython developmentGithub, Github action includes Scans like Sonar, AppSec Branching strategyGitOpsPython API developmentExperience in DevOps Architecture design and strategy.how to deploy same authentication in Lambda and EKSServer less authentication services\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "8_Sr. Business Analyst": "Boopathy,\nSmart IT Frame\nboopathy@smartitframe.com\nReply to: boopathy@smartitframe.com\nHi,Greetings from Smart IT Frame, Hope you are doing well!!! Smart IT Frame specializes in enabling you with your most critical line of resources. Whether it’s for permanent staffing, contract staffing, contract-to-hire or executive search, we understand the importance of delivering the most suitable talent; on time and within budget. With our Core focus in emerging technologies, we have provided global technology workforce solutions in North America, Canada & India. We take pride in delivering specialized talent, superior performance, and seamless execution to meet the challenging business needs of customers worldwide.Role: Sr. Business AnalystLocation: Dallas, TX(Onsite)Mode of Hiring – ContractShift timing: 9AM – 6PM Skills:AWS, Python, Snowflake, SQL--Thanks and RegardsBoopathy Rajan STalent Acquisition GroupEmail: boopathy@smartitframe.com Smart IT Frame LLC.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "10_L1 Triage Specialist in Dallas, TX - Onsite": "Neha,\nAvance Services\nneha.s@avanceservices.com\nReply to: neha.s@avanceservices.com\nHi Folks,Role:L1 Triage SpecialistLocation: Dallas, TX (Onsite)Job Description:Must have monitoring tools expertise on following: Grafana, ELK, NewRelic and KibanaMust have good working experience on following ticketing tools: JIRA, Service Now, Service Now DeskMust have triaging skills on: AWS, Kubernetes, RabbitMQ, IBM MQ etc.Must have basic triaging skills for Infra and Networking issuesRegards, Nehaneha.s@avanceservices.com\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "11_Contract role hiring on DNS Engineer": "Deepika Dua,\nStellar Consulting Solutions LLC\ndeepika.dua@stellarconsulting.com\nReply to: deepika.dua@stellarconsulting.com\nMy name is Deepika & I am a recruiter at Stellar Consulting, and I came across your profile while looking for qualified candidates for a DNS Engineer role. I was impressed by your experience and skills . I think you would be a great fit for this role, as you have almost all the skills & experience required for the role.Below are the job details for your reference.Job Title : DNS EngineerLocation : Remote Duration : 3+ Months Job Description Summary: ResponsibilitiesDesign, deploy, and maintain AWS Route 53 DNS infrastructure that provides highly available and scalable DNS services across our network.Take inventory of the current DNS system and work with IT stakeholders to design a modern cloud-based (AWS) DNS system.Collaborate with network engineers, system administrators, and cybersecurity specialists to integrate DNS solutions into our network architecture and security framework.Implement DNS policies, DNS views, and DNSSEC configurations to enforce access control, prevent DNS spoofing, and enhance the security of our DNS infrastructure.Where necessary, make changes and/or remediate issues with the current DNS system.Define workarounds for known errors and initiate process improvements and work with your peers to improve and/or remediate the configuration of the current DNS system; identify and manage risks and issues.Performs device configurations, internal operating system upgrades and software upgrades and deploys physical/VM appliances to support corporate DNS infrastructure.Troubleshoots DDI problems and recommends corrective procedures; leads troubleshooting DDI issues. Configure and maintain DNS, DHCP, and IP Address Management (DDI) solutions to ensure optimal performance and security. Maintain current DNSSEC infrastructure and configuration to enhance DNS security.Monitor and analyze DNS traffic for anomalies and potential threats. Minimum Qualifications / Skills:BS or BA degree, Computer Science, Engineering, or equivalent education, training or work experience required.DNS Engineer, with expertise in designing, implementing, and managing DNS protocols, DNSSEC, BIND, DHCP, IPAM, and related networking technologies, including TCP/IP, UDP, DNS over TLS (DoT), and DNS over HTTPS (DoH) solutions.Experience planning and executing migrations to or from any of the various DDI OEM platforms.Deep knowledge on DNS and BIND, working knowledge of network automation for UNIX and Windows operating systems.Experience with Disaster Recovery testing and simulating a recovery environment.Experience with scripting languages, such as Python, Perl, PowerShell, or BASH for automating tasks, generating reports, and interacting with APIs.Knowledge of cybersecurity principles and best practices related to DNS security, including DNS cache poisoning, DDoS attacks, and DNS firewall configurations.Certifications such as Infoblox Certified Implementation Engineer (ICIE), AWS solution architect, or equivalent certifications are desirable.Excellent analytical and problem-solving skills, with the ability to diagnose and resolve complex DNS issues and performance bottlenecks.Strong communication and interpersonal skills, with the ability to collaborate effectively with cross-functional teams and stakeholders.Ability to work independently and prioritize tasks in a fast-paced environment, managing multiple projects and deadlines effectively. Deepika DuaSr. Technical Recruiter at Stellar Consulting Solutions, LLCPhone: +1 678-935-7075Email: deepika.dua@stellarconsulting.comLinkedIn: https://www.linkedin.com/in/deepika-dua-018459166/\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "12_Data Scientist": "Ashwani Raghuvanshi,\nTek Inspirations\nashwani.raghuvanshi@tekinspirations.com\nReply to: ashwani.raghuvanshi@tekinspirations.com\nJob Description -Need really technically strong candidate's who must have great comm skills and all skills below listed.PV will take video screening callEC- VanguardTitle- Data ScientistDuration- 6+ MonthsLocation- Malvern, PA - Hybrid Visa-HIB , GC-EAD, H4-EAD,OPT-EADMOI - Skype.They need to be true blue data scientist – no analyst no engineer must be scientistCandidates great have great hold on: AWS Sagemaker, Python, End to End Lifecyle of MLPractitioner, critical thinker, strong comms – most important thing – person should be able to go above & beyond, explain with well detailsRegression modelsData structuresMLNLPTime SeriesProjection AnalysisTranslate inferences and predict themTalking to hiring manager about solving and optionsJD:Analyzes large, structured, or unstructured data sets to generate predictive insights and new innovations. Uses several techniques to obtain answers to business questions, including statistics, predictive analytics, advanced coding techniques, and machine learning and artificial intelligence. Evaluates statistical models, identifies patterns, develops, and applies algorithms to determine validity of analyses, tests models, and develops visualizations to assist in business decisions. Qualifications:Experience in data modeling techniques to analyze large data sources and generate predictive insights and solutions. Evaluates statistical models, identifies patterns, develops and applies algorithms to determine validity of analyses, tests models, and develops visualizations to assist in business decisions. Specializes in applying knowledge of experimental methodologies, statistics, optimization, probability theory, and machine learning concepts to create self-running artificial intelligence (AI) systems to automate predictive models. Evaluates existing statistical models using both general purpose software and statistical languages with the goal of adjusting and optimizing efficiency specifically within production environments.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "13_Azure cloud architect - .net and systems azure, aws (multi-cloud) Onsite role  No H1b": "ayush,\nistaff\nayush@istaffx.com\nReply to: ayush@istaffx.com\nHiHope so you are doing Good!!!Please find the Job Description. If you feel comfortable yourself then send me your updated resume or call me back on 575-236-4255.cloud architect - .net and systems azure, aws (multi-cloud).location: Tallahassee, Floridajob type: Contractwork hours: 8am to 5pmeducation: No Degree RequiredNo h1BApplication Services is in search of a Cloud and Systems Architect to play a key role in assisting the Office of Information Technology in the establishment, adoption, continued execution of cloud services, and the maintenance of existing legacy systems.General responsibilities may include the following:Promote cultural change for cloud adoption Assist in ongoing modernization and migration efforts Expand upon cloud strategy and coordinate adoption Architect, design, facilitate, lead, coordinate, and direct cloud initiatives on multiple fronts across a variety of disparate areas within the organization, this could include Application development; Data management, analytics, and protection; external IT hosting; Identity and access management; Infrastructure; Network; Security, privacy, and compliance; User experience.EducationBachelor's Degree in Computer Science or another related field4 years of experience can substitute for educationExperience2 - 3 years of strong professional experience as a Microsoft Azure cloud systems architect is required.2 - 3 years of experience with other cloud providers, such as AWS or GCP is highly desired.5 - 8 years of professional experience in information systems engineering or another related field is required.5 years of professional experience supporting middleware such as API Management, IT Service Automation tools, and batch job services is highly desired.Experience with .Net application development in a DevOps environment is highly desired.2 - 3 years of professional experience in administration of ESRI GIS software is highly desired.2 - 3 years of experience with Enterprise Architecture is required.Microsoft Azure certification is highly desired.Primary Job Duties/ TasksThe activities this candidate will be tasked with include, but are not limited to, the following:Build and manage relationships in a matrixed environment Recommend and assist with the building and hosting of complex application solutions. Understand, deploy, and manage Microsoft Azure cloud services. Resolve production release issues across business and technology teams, as well as broader strategic or systemic issues that are creating inefficiencies or hindering progress. Enhance application and system monitoring solutions to ensure the right staff get the right alerts. Reviews, advises, and designs standard software and hardware builds, system options, risks, costs vs. benefits and impact on the enterprise business process and goals. Automate processes wherever possible. Create and manage Azure DevOps projects, git repositories, and pipelines. Troubleshoot development issues brought forth by developers and other architects. Present to your peers on findings of new technologies, enterprise-wide issues, and enhancements you have made to better the mission.Job Specific Knowledge, Skills, and Abilities (KSAs)The knowledge, skills, and abilities desired for this position include, but are not limited to the following:strong analytical skills to determine an organization's needs, develop strategies to meet those needs, and evaluate effectiveness. Ability to categorize work, set priorities, and determine short and/or long-term goals and strategies to achieve them. Ability to troubleshoot and diagnose problems effectively regardless of technology platform Able to easily convey knowledge to others. Proficiency in working in a fast-paced, complex, dynamic, and multicultural business environment In-depth knowledge of Microsoft Azure Services. In-depth knowledge of Microsoft Server products. In-depth knowledge of Linux (Redhat and Ubuntu). strong grasp of IT infrastructure and application development technology and architectures. Knowledge of assessment and analytical process and practices. Skill in strategic planning. Skill in researching, compiling, and analyzing data to report findings and develop improvement solutions. Skill in application administration and hosting across a wide range of solutions Ability to research, identify, and implement innovative solutions. Ability to communicate effectively; both verbally and written. Ability to establish and maintain effective working relationships. Ability to work independently and as a team.General Knowledge Skills and Abilities (KSAs):The submitted candidate must be able to apply common knowledge, skills, and abilities in the following areas:1. Initiative: Must be able to comprehend assignments, organize workload, and meet deadlines with little direction. Must be able to monitor and analyze situations to determine the next step.2. Communication: Can clearly convey information, in both written and verbal formats, to individuals or groups in a wide variety of settings (i.e., project team meetings, management presentations, etc.). Must have the ability to effectively listen and process information provided by others.3. Customer Service: Works well with clients and customers (i.e., business office, public, or other agencies). Able to assess the needs of the customer, provide information or assistance to satisfy expectations or resolve a problem.4. Decision Making: Makes sound, well-informed, and objective decisions utilizing critical thinking skills and analysis.5. Flexibility: is open to change, new processes (or process improvement), and new information. Can adapt in response to new information, changing conditions, or unexpected obstacles. Ability to receive and give constructive criticism and maintain effective work relationships with others.6. Interpersonal: Shows friendliness, courtesy, understanding, and politeness to others7. Leadership: Motivates, encourages, and challenges others. Can adapt leadership styles in a variety of situations.8. Problem Solving: Able to identify, evaluate, and use sound judgement to generate and evaluate alternative actions, and make recommendations as accordingly.9. Team Building: Encourages, inspires, and guides others toward accomplishing the common goal as an equal member of the team.10. Quality Assurance: Knowledge of the ideologies, techniques and tools for quality assurance and control. The ability to put the ideologies, techniques, and tools into practice. qualifications:Experience level: ExperiencedMinimum 8 years of experienceEducation: No Degree Required (required) skills:· Cloud· .NET· Linux· Redhat and Ubuntu· Microsoft Server· Azure· AWS· GCPAyush Kumar | IstaffX LLC.Technical Recruiting Lead , Email: Ayush@istaffx.comPhone: 575-236-4255Website - https://istaffx.com/\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "15_L1 Triage Specialist || Dallas, TX": "Deepak Kumar,\nTechnosphere\ndeepak@technosphere.com\nReply to: deepak@technosphere.com\nHi, Hope you are doing well!! Please find the requirement below, If you find your-self comfortable with the requirement please reply with your updated resume and I will get back to you or I would really appreciate if you can give me a call back at my contact number (929) 292-1155 EXT 115 or email me deepak@technosphere.com Job Title : L1 Triage SpecialistJob Location : Dallas, TXJob Description:L1 Triage Specialist:Must have monitoring tools expertise on following: Grafana, ELK, NewRelic and KibanaMust have good working experience on following ticketing tools: JIRA, Service Now, Service Now DeskMust have triaging skills on: AWS, Kubernetes, RabbitMQ, IBM MQ etc.Must have basic triaging skills for Infra and Networking issuesDeepak Kumar | Sr. Talent Acquisition LeadOne Rockefeller Plaza, 11th Floor, New York, NY 10020 email: deepak@technosphere.comWhatsapp:+91-8178880487\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "17_Please send the Local Profiles - Pyspark Developer-New York City, NY - Wilmington,DE": "santhosh,\nInfinity Quest\nsanthosh.a@i-q.co\nReply to: santhosh.a@i-q.co\nPyspark Developer (OPT is also Fine)NYC, NY - 1st Preference local candidateWilmington, DE Job Description:• Develop and maintain data platforms using Python, Spark, PySpark• Handling migration to PySpark on AWS• Work with AWS and Big Data, design and implement data pipelines, and ensure data quality and integrity.• Collaborate with cross functional teams to understand data requirements and design solutions that meet business needs.• Implement and manage agents for monitoring, logging, and automation within AWS environments\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "19_Very Urgent Job Opportunity of AWS LEAD (TECHNICAL LEAD) at Location- San Antonio, TX (Onsite) is shared with you": "Raghwendra Rao,\nIDC Technologies\nraghwendra.rao@idctechnologies.com\nReply to: raghwendra.rao@idctechnologies.com\nGreetings! This is Raghwendra from IDC Technologies, and I am writing to you regarding an excellent job opportunity that I have with one of IDC’s premier clients in San Antonio, TX (Onsite). I found your resume during my search for qualified candidates on the internet and would like to know if you would be interested in pursuing this opportunity. Please share your updated resume if interested. Job Title: AWS LEAD (TECHNICAL LEAD)Position Type: CTH Location: San Antonio, TX (Oniste)Min. Exp- 12 Years Mandatory Skillset: AWS Architecture, AWS Services-Lambda Functions, AWS EC2, AWS S3Bucket, AWS EKS, RDS, SQS, Dynamo DB, Terraform SNS/ SQS, Java/J2EE, SOA, API Integration, Docker/Container/ Kubernetes, IAASOverview:Looking for talented cloud Developer (Lead) responsible for developing design and architecture to support cross domain business capabilities. Candidate will focus on the intentional architecture and provide mentorship on emergent architecture to the technical teams. Candidate will have hands-on experience in cloud architectures (SaaS, PaaS, IaaS) and deep interest and experience in broad enterprise platforms and cloud patterns. Job Description:Participate in producing conceptual, solution and component-level architectures and associated artifacts. Develop cross domain business requirements reference architecture for transition and target state and contribute to the cloud related patterns and implementations. Develop common components for shared business capabilities with Standards and best practices. Develop the transition architecture using services offered by AWS and private cloud.Migrate legacy applications to AWS and private cloud. Hands on experience with AWS cloud networking including VPCs, Subnets, Security Groups, ACLs, Transit Gateways, ALB/NLB, Route53, ACM, API Gateway and related technologies.Understanding of networking processing, protocols, and standards - TCP/IP, UDP, DNS, HTTPHands on experience with security mechanisms including mTLS, x509, OpenID Connect, JWT/JWE, OAuth2, PEP/PDP, SAML, WS-Security, Basic Auth and ABAC/RBAC based policies.Hands on “code first” development of cloud configuration and components from the ground up using tools like Gitlab and TerraformStrong hands-on experience in one or more development languages including Java, python, Golang.Experience with Open Trace, AWS Cloud Watch, DataDog, Prometheus, ELK, Grafana, Hystrix,, App Dynamics, NetCool and other tools to ensure the cloud is operating as expected.Hands on experience with continuous delivery (CD) tooling including Jenkins, GitLab, Travis CI, GoCD and others.Hands on experience with Containers including tools like Docker, Kubernetes, ECS/ECR, and other related technologies and tools.Experience in explaining complex technology decisions and developing high trust relationships with stakeholders. Ability to develop target state architecture using services offered by AWS and private cloud and vision to develop the transition architecture. Ability to design patterns for moving legacy applications to AWS and private cloud. Hand on experience with common architecture patterns (microservices, event-driven, REST, NO SQL databases, Caches, etc.) and services offered by AWS (S3, EKS, Lambda, RDS, elastic search, etc.) Hands on experience addressing operational and non-functional concerns (e.g. scalability, performance, maintainability, load distribution, resilience and recovery, etc.) Experience with SAFe framework or other similar agile frameworks. Experience with Java, Kafka, Spring, Redis, Kubernetes, OpenShift and others. Guidewire experience is big plus.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "20_Trying to reach you for - L1 Triage Specialist  Dallas, TX": "Ajay,\nYochana IT\najaym@yochana.com\nReply to: ajaym@yochana.com\nHi I hope you are doing well and having a great day! I wanted to reach out to you regarding a Contract job opportunity as L1 Triage Specialist – Dallas, TX. Client has a strong reputation for being one of the leading employers in the industry. After reviewing your qualification and resume, I feel you would be a good fit for this role. I have listed some of the main requirements for this position below for your review. Required – Telecom Background is Must Position Name – L1 Triage SpecialistType of hiring – ContractLocation – Dallas, TX (Onsite role) Job Description: Must have monitoring tools expertise on following: Grafana, ELK, NewRelic and KibanaMust have good working experience on following ticketing tools: JIRA, Service Now, Service Now DeskMust have triaging skills on: AWS, Kubernetes, RabbitMQ, IBM MQ etc.Must have basic triaging skills for Infra and Networking issues Thanks & Regards,AjayYochana IT Solutions INC,23000 Commerce Dr, Farmington hills, MI-48335Let’s Challenge The Status Quo\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "22_Need API Developer (Google Apigee Edge platform) - NYC, NY - Onsite": "Venkat Ram,\nNeo Tech Solutions, Inc.\nvenkat@neotechusa.com\nReply to: venkat@neotechusa.com\nHi ,Hope you are doing wellPlease find the below Job Description and let me know if you are interested in applying for this position. Position: API Developer (Google Apigee Edge platform)Duration: 12 MonthsLocation: NYC, NY - Onsite Job Description:Responsibilities:Responsible for the Solution Architecture for the API platform and API on-boardingDesign and develop REST APIs using API Management platform. Create REST API documentationConvert web services from SOAP to REST or vice-versa, using API management platformImplement requirements of the API layer like security, custom analytics, throttling, caching, logging, request and response modifications etc. using API management platformMaintain programming standards and ensure the usage of the pattern / template for API ProxyConduct code reviews and coach developersEnsure proper approach on traffic control and API securityCreate custom policies in Java, JavaScript, Node JS, Python etc. in API management platformStandardize the CI/CD setup for API management tools and automated deploymentMaintain the SLA, health and well-being of the API platform infrastructureAutomation of API testingRequired Skills:Advanced verbal and written communication skills to present ideas and concepts effectivelyHands-on development expertise with the Google Apigee Edge platform including but not limited to installation and configurationSolid understanding of API and integration design principlesAPI focused integration design and patterns experience for the webExperience implementing requirements of the API layer like security, custom analytics, throttling, caching, logging, request and response modifications etc. using API management platformExperience with designing and developing API proxies and REST APIs using API Management platformSignificant experience designing, deploying, and supporting production cloud environments, such as Amazon Web Services (AWS) and private cloud environments.Experience creating custom policies in Java, JavaScript, Node JS, Python etc. in API management platformExpertise in configuring the Apigee Private Cloud platform, including keystores, trust stores, and KVMsAbility to apply security, throttling, OAuth 2.0, TLS, certificates, KeyStore, and Trust store for the Apigee platformExperience with CI/CD Tools (Jenkins, GitHub) for Apigee proxies deployment automation.Hands-on experience in designing and developing high volume web services using API Protocols and Data Formats (REST, JSON, SOAP & XML). Required details for submissionFull Name: Email id:Contact Number:Current Location:Relocation:Interview Availability:Notice Period:Visa Status:Any Interviews in Pipeline:Any offers in Pipeline:Linked in: Pay rate: Thanks & RegardsVenkat RamTalent Acquisition Manager+1 (908) 864-9002venkat@neotechusa.comNeo Tech Solutions, Inc.Suite 204, 515 Plainfield Ave, Edison, NJ 08817\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "23_Immediate opening for Angular JS Developer in Denver, CO (Locals Only)": "chaitanya,\nconflux systems\nchaitanya.p@confluxsystems.com\nReply to: chaitanya.p@confluxsystems.com\nHello, I hope you are doing well! Role: Angular JS Technology Lead developerLocation: Denver, CO (The client wants local profiles & the work is performed from the client location 5 days a week)Type: ContractOpenings: 2Duration: 12 monthsAlthough the JD is detailed, in a nutshell, we are looking for Strong Angular JS tech leads with 8-10 years of experience in Angular. Job Summary: Translates user requirements into design for new software or extensive software revisions. Creates high-level architectural specifications, while ensuring feasibility, functionality, and integration with existing systems and platforms. Provides expertise on cross-application implications. Approves business requirements, estimation, functional specifications, testing strategy and other activities to ensure architectural alignment. Works closely with stakeholders to identify and negotiate Experience: 8 to 12yrs. Technical Skills: Angular, Ionic, TypeScript, Ngrx, RxJS Nice to have skills: Technical Skills: Graphql Domain Skills: Billing & Revenue Management, Networks, Devices Technology: Custom Skills Shift: Day Roles & Responsibilities:·Translates user requirements into design for new software or extensive software revisions. Creates high-level architectural specifications, while ensuring feasibility, functionality, and integration with existing systems and platforms.·Provides expertise on cross-application implications. Approves business requirements, estimation, functional specifications, testing strategy and other activities to ensure architectural alignment.·Works closely with stakeholders to identify and negotiate opportunities to apply architecture standards and guidelines.·Deep understanding and hands-on of modern coding technologies including Typescript, HTML, CSS, JS, Angular, Ionic, NGRX, Capacitor, GraphQL build runners, pre-processors (e.g. Babel, SASS/LESS, etc.), and related development technologies. Knowledge of infrastructure technologies -- Docker, Kubernetes, Ci/Cd tools and technologies Understanding of best practices in responsive web and app UX design Knowledge of micro frontends and module-federation Look forward to hearing from you. --Best Regards Swaroop Yerramsetty |Sr. IT Recruiter Fax : 615-469-3238 | swaroop@confluxsystems.com 11539 Park woods Cir, Suite 302, Alpharetta, GA, 30005 Conflux Systems INC, a Minority and Small Business Enterprise https://www.linkedin.com/in/swaroop-yerramsetty-a1b6a720a/\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "24_Hiring || Cloud Developer || Atlanta, GA Need a local candidateHybrid": "sakthivel,\nERPMark\nsakthivel@erpmark.com\nReply to: sakthivel@erpmark.com\nRole :Cloud DeveloperLocation : Atlanta, GA Need a local candidate HybridDuration : Long Term Note : Have to F2F interview JD: Strong AWS development with Python exp -Lambda, S3, Athena,Glue, DynamoDB, Event bridge\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "26_Need Kafka Developer _ Weehawken, NJ": "Ashok,\nSoftcom Systems, Inc\nashok@softcomsystems.com\nReply to: ashok@softcomsystems.com\nHi,Hope you are doing good.This is Ashok from Softcom System,We have below urgent requirements. Please find the below JD and share your interest,Role :: Kafka DeveloperLocation: Weehawken, NJDuration: Long termExperience designing secure and stable Kafka platforms.Physical deployment of infrastructure across multiple environments.Optimization and tuning of Kafka plant for peak performance.Standards and patterns development for Kafka usage.User guide development and training overviews for supporting teams.Provide troubleshooting and best practices methodology for development teams.Process automation and new application on-boarding, integration with CICD pipeline.Design monitoring solutions and baseline statistics reporting to support the implementation.Level 3 support for development teams that are utilizing the platform.Planning and execution of infrastructure projects as well as on-boarding of new application development projectsMentors L1/L2 support groups.Partner with development teams to provide KafkaPlease send below details for submissionFull Name:Date of Birth (mm/dd/yyyy):Available from (mm/dd/yyyy):SSN (Last 4 digits):Contact Number:Alternate Number:Email ID:Total IT Experience (Years):Work experience in USA (Years):Previously worked With Infosys? :Current Location:Visa Status:Passport No:Skype ID:LinkedIn:Education(Branch & University):Year of Passed Out:Ready for In-person Interview:Ready for Relocation:Availability for Interview(5 Time slots for Next 3 Business Days):Employer Details:Name:Phone:Email:\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "27_DocumentumConsultant Developer: Remote": "Upama,\nCBS\nupama@cbsllc.us\nReply to: upama@cbsllc.us\nDocumentum Consultant Developer : RemoteDuration: 12 months + extensionResponsibilities:· Gather and analyze functional requirements· Production of technical documentation· Build the current and future systems (prototyping, new functionalities, and maintenance tasks)· Define and execute unit and integration tests· Assist and support Business usersRequired:· 4 years of work experience in Documentum technology (DFC, DQL, D2 configurations), ideally including experience with version 22.1 or greater· Advance knowledge of software development using Java/J2EE· Ideally have experience with: CTS, Xplore, Content Server DQL/API, and Blazon· Define Documentum repository structure and Object types.· Experience in the design and development of web services· Experience in the use of source version control systems· Experience with relational databases· Plus to have experience with AWS and DevOps tools for release, configuration management, monitoring, development (e.g. - Jenkins, GIT, Docker, AWS EKS, AWS Step function, AWS Lambda creation, Jira, Python, Angular, Splunk etc)· Experienced with implementing solutions using Java & J2EE technologies, REST, Web Services, Springboot, GWT framework· Experienced with databases like Oracle and SQL Server, PostgresSql.· Experienced with Application servers like Weblogic, JBoss, or Tomcat· Experienced with providing support for existing production applications, troubleshooting, resolving problems.· Strong interpersonal & communication skills and proven independent & teamwork capabilities.· Experienced with agile methodology of developmen\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "28_Trying to reach you for Implementation Engineer or L2 Support Engineer or SRE  Dallas, TX": "Ajay,\nYochana IT\najaym@yochana.com\nReply to: ajaym@yochana.com\nHi I hope you are doing well and having a great day! I wanted to reach out to you regarding a Contract job opportunity as Implementation Engineer or L2 Support Engineer or SRE – Dallas, TX. Client has a strong reputation for being one of the leading employers in the industry. After reviewing your qualification and resume, I feel you would be a good fit for this role. I have listed some of the main requirements for this position below for your review. Required – Telecom background in Must Position Name – Implementation Engineer (IE L2)/L2 Support EngineerType of hiring – ContractLocation – Dallas, TX (Onsite role) Job Description: Should have extensive troubleshooting experience and expertise in mitigation and resolution techniques.Responsibilities include root cause analysis and working with partners and COTs vendors for implementation of prod fixes.Experience with Jenkin Jobs and Ansible scriptingHands on experience in Core Java, Unix, Shell Scripting, Python, Application Deployment, DevOps, Kibana, Kubernetes, Rabbit MQ, IBM MQ, WebSphere.Implement Load Balancer changes working with various teamsImplement firewall rules working with network teamsImplement certificates / renew certificates across Applications, Load Balancers, DB, MQ, Apigee, etc.Troubleshooting of degradation and performance issues.Experience with monitoring tools like New Relic, Grafana, Kibana, etc.Experience with Pega platform.AWS cloud hands on experience with Provisioning EC2 instances. Rehydration.EKS clusters. Thanks & Regards,AjayYochana IT Solutions INC,23000 Commerce Dr, Farmington hills, MI-48335Let’s Challenge The Status Quo\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "32_Senior DevOps Engineer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nLoopNet - Senior DevOps EngineerJob Overview CoStar Group (NASDAQ: CSGP) is a leading global provider of commercial and residential real estate information, analytics, and online marketplaces. Included in the S&P 500 Index and the NASDAQ 100, CoStar Group is on a mission to digitize the world's real estate, empowering all people to discover properties, insights and connections that improve their businesses and lives. We have been living and breathing the world of real estate information and online marketplaces for over 35 years, giving us the perspective to create truly unique and valuable offerings to our customers. We've continually refined, transformed and perfected our approach to our business, creating a language that has become standard in our industry, for our customers, and even our competitors. We continue that effort today and are always working to improve and drive innovation. This is how we deliver for our customers, our employees, and investors. By equipping the brightest minds with the best resources available, we provide an invaluable edge in real estate. We are currently seeking an accomplished Senior DevOps Engineer to join our team, while supporting our multiple software products and brands across the organization, such as LoopNet , Apartments.com , Homes.com , and Ten-X .This position is located in Irvine and offers 2 days remote per week. ResponsibilitiesGrow the team's experiences and skillset through knowledge sharing and by having proactive and team-centered attitude.Automate and leverage DevOps principles, always striving for operational excellence with infrastructure-as-code mentality.Utilize cutting-edge technology to improve our services and processes.Manage enterprise level web applications.Collaborate with development and operations team to design and build scalable and secure infrastructure.Practice continuous integration/continuous delivery (CI/CD) using latest DevOps tools and innovative methods.Ensure the health and uptime of critical systems and applications with pro-active monitoring and metrics analysis.Strong troubleshooting skills (application, network, systems, infrastructure) with ability to multi-task and context switch.Good communication skills, expresses oneself clearly both verbally and in writing.Participate in a weekly on-call rotation once on-boarded.Basic QualificationsBachelor's Degree required from an accredited, not-for-profit university or college.A track record of commitment to prior employers.5+ years' experience with managing heavy web traffic sitesIaC (Terraform, Cloudformation)CI/CD (Azure DevOps)Kubernetes / EKSAWS (EC2, ALBs, S3, IAM, ASG, Lambda, Dynamo, Step Function, Elasticache, OpenSearch, etc.)Enterprise monitoring tools in areas of APM, system vitals, synthetics, and RUM (DataDog, AppDynamics, Prometheus, Icinga).Scripting language (PowerShell, Bash, YAML)Configuration management (e.g., Chef, Ansible)Experience with configuring CDN for performance caching and global traffic management.Preferred Qualifications And SkillsSome developer background with either Java, C#, Python, NodeJSFamiliar with load balancing technologies such as F5 LTMs, including management of VIPs, pools, nodes, iRule authoring, SSL offloading.SQL or No SQL databasesServer-less architecture methodologiesFamiliarity with PCI compliance and remediationAgile methodologies and working on short sprint cyclesWhat's in it for You When you join CoStar Group, you'll experience a collaborative and innovative culture working alongside the best and brightest to empower our people and customers to succeed.We offer you generous compensation and performance-based incentives. CoStar Group also invests in your professional and academic growth with internal training, tuition reimbursement, and an inter-office exchange program.Our benefits package includes (but is not limited to):Comprehensive healthcare coverage: Medical / Vision / Dental / Prescription DrugLife, legal, and supplementary insuranceVirtual and in person mental health counseling services for individuals and familyCommuter and parking benefits401(K) retirement plan with matching contributionsEmployee stock purchase planPaid time offTuition reimbursementOn-site fitness center and/or reimbursed fitness center membership costs (location dependent), with yoga studio, Pelotons, personal training, group exercise classesAccess to CoStar Group's Diversity, Equity, & Inclusion Employee Resource GroupsComplimentary gourmet coffee, tea, hot chocolate, fresh fruit, and other healthy snacksWe welcome all qualified candidates who are currently eligible to work full-time in the United States to apply. However, please note that CoStar Group is not able to provide visa sponsorship for this position.This position offers a base salary of $124,000 - $211,000, based on relevant skills and experience and includes a generous benefits plan.#LI-IZ1 #LI-HybridCoStar Group is an Equal Employment Opportunity Employer; we maintain a drug-free workplace and perform pre-employment substance abuse testingEmployers have access to artificial intelligence language tools (“AI”) that help generate and enhance job descriptions and AI may have been used to create this description. The position description has been reviewed for accuracy and Dice believes it to correctly reflect the job opportunity.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "34_IT Service Desk Manager": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nHigh-Growth Organization, seeking Service Desk Manager for IT/DevOps!This Jobot Job is hosted by: David DeCristofaroAre you a fit? Easy Apply now by clicking the \"Apply Now\" button and sending us your resume.Salary: $90,000 - $130,000 per yearA bit about us:Based in Los Angeles, CA and founded in 2012 by a team of proven entrepreneurs in the industry, we are a fast-growing startup that is revolutionizing the mobile gambling space in the United States! We are the 1st in the Industry to have legalized mobile gambling in the United States. With over 3 dozen issued patents, we are one of the most well-funded startups in Los Angeles, in one of the largest entertainment segments on the planet, in gambling.If you consider yourself to have a proficiency in Ruby on Rails development and/or Golang development, please read on...Why join us?Do you want to step into an established start-up with the opportunity to grow your career and your bank account? We do too!Competitive Base Salary!Extremely Competitive Equity Package!Flexible Work Schedules!Accelerated Career Growth!Job DetailsWe are seeking an IT Service Desk Manager to join our growing infrastructure team. The Service Desk Manager is responsible for managing and resolving system incidents and ensuring the stability and reliability of IT and DevOps environmentsResponsibilities:1. Oversee the daily operations of the Service Desk, ensuring a high level of customer service and user satisfaction.2. Implement, manage and maintain IT service management tools such as DataDog, Splunk, Atlassian, JSM, Jira, and/or Confluence.3. Develop and enforce request handling and escalation policies and procedures.4. Lead the team in identifying, troubleshooting, and resolving system and network issues.5. Drive continuous improvement initiatives to increase efficiency and improve performance.6. Leverage scripting and automation skills to streamline processes and workflows.7. Conduct root cause analysis for major incidents and develop strategies for prevention.8. Coordinate with IT and DevOps teams to diagnose and troubleshoot complex system issues.9. Provide training and mentorship to Service Desk staff and foster a positive work environment.9. Prepare and present regular performance reports for senior management.Qualifications:1. Bachelor's degree in Computer Science, Information Technology, or related field.2. Minimum of 5 years of experience in a Service Desk Manager role or similar.3. Proven experience with IT service management tools such as DataDog, Splunk, Atlassian, JSM, Jira, and/or Confluence.4. Strong knowledge of scripting and automation techniques using Python, Bash, PowerShell, or similar5. Solid understanding of ITIL principles and practices.6. ITIL certification is a plus.Interested in hearing more? Easy Apply now by clicking the \"Apply Now\" button.Employers have access to artificial intelligence language tools (“AI”) that help generate and enhance job descriptions and AI may have been used to create this description. The position description has been reviewed for accuracy and Dice believes it to correctly reflect the job opportunity.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "35_Urgent Need: Azure Architect with EventHub, Snowflake and Cosmos DB, 100% Remote": "SAPNA,\nITECS\nsapna@itecsus.com\nReply to: sapna@itecsus.com\nUrgent need from Infocepts. Only US Citizens. Phone + Video interview.100% Remote from US location. Primary Skills: Technologies/Tools: Azure, EventHub, Snowflake, Cosmos DB, Managed Airflow, API Gateway & DBT Job Title: Azure Architect with EventHub, Snowflake and Cosmos DBWork Location: Onshore in USA – 100% Remote Purpose of the Position: Purpose of this role is to design and build data architecture for a migration project. Major responsibilities under this role would be to create high level and low level design for data integration framework, translate the business requirements into technical prototypes, help developers in developing the data integration pipelines, perform peer reviews of the code, own the technical delivery of the DI part from inception to the deployment. Also own the technical consultation for existing or new clients during initial phase of any initiative and help in proposals and pre-sales initiatives. Must Have Technical Experience:At least 12 years of IT experience; Minimum 5 years of experience on AzureMust have minimum 5+ years of experience in implementing and managing Azure Cloud components.Expertise in Python and SQL best practicesExperience in data and analytics domainKnowledge of integrating Azure Active Directory with other servicesIn-depth experience of key Azure services for data integration, BI and processing services including but not limited to Azure HDInsight, Azure Databricks, Azure Portal, Log Analytics, Azure Data Factory, , Azure Search, Azure Functions, Azure Stream Analytics, Managed Airflow and Azure Event Hub.Experience in Azure cosmos DB over PostgreSQL, mongo dB and live streaming with Azure EventHub.Experience on Azure functions with Python language.Experience in migration of on-prem applications and data analytics workload to Azure cloud. Experience in designing Azure cloud architecture and operationalizing solutions around monitoring, alerting, logging etc.Working knowledge on Architecture design, Modelling, prototyping, and benchmarking of DataStore/ EDW solutions.Knowledge of variety of advanced architecture, tools, and concepts across all layers of modern distributed technology stack covering the big data ecosystem.Knowledge of Azure storage services such as Azure storage account, Azure Cosmos DB, Azure Time Series Insights, Redis Cache, SQL Databases, Table StorageExperience with programming languages such as PythonExperience in enabling DevOps automation for Azure with appropriate security and privacy considerations.Knowledge of configuring and provisioning networks and infrastructure in cloudGood to have knowledge of Big Data ecosystems such as Hadoop / Hive, HDFS, Spark, YARN and others.Good to have Snowflake, Scala, and Java experienceGood to have Technical Experience:Pre-sales experience will be an added advantage.Any BI experienceExperience in any other cloud technologies like AWS, ALI, GCP.Snowflake, DBT, Scala and JavaTechnologies/Tools: Azure, EventHub, Snowflake, Cosmos DB, Managed Airflow, API Gateway & DBTQualifications:Bachelor’s degree in computer science, engineering, or related field (master’s degree is a plus)Demonstrated continued learning through one or more technical certifications or related methods. ---------------------------------------------------------------------------------------------------------------------------Please follow the submission format table provided and ensure all required information is included with each submission with resume. Incomplete submissions will be disqualified. Candidate Legal Name (As per Documents) Summary Year of experience in each skillset: Email Address Phone Number Work Authorization Current Location For non-local, Relocation (Yes/No) Pay Rate Current working status Reason for change LinkedIn Profile Availability for Interview (Please provide 03 time slots) Availability for Joining the project\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "36_Java Engineer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nJava Engineer - ONSITE in Waukegan, IL - Best in Class Organization - +10Bn OrgThis Jobot Job is hosted by: Dan UrbaniakAre you a fit? Easy Apply now by clicking the \"Apply Now\" button and sending us your resume.Salary: $120,000 - $140,000 per yearA bit about us:Family-owned for over 4 decade and North America's leader in shipping, industrial, and warehouse supplies with over 35.000 items in stock! We pride ourselves on our top-notch culture, attention to detail, and consistent growth. If you're looking for a stable organization to plant your roots and grow with for the long haul, you may have just found your new home! Over $8.5 billion in revenue generated last year!Why join us?Healthcare benefits401k with match16 days PTOProfit sharingBonusesOn-site workout facilitiesSubsidized lunchesPaid relocation and much more!Job DetailsWe are seeking a highly motivated and experienced Java Engineer to join our dynamic team. As a Java Engineer, you will be responsible for designing, developing, and maintaining high-quality software applications using Java, Spring Boot, Angular, SQL, microservice architecture, Cassandra, ELK Stack, and other cutting-edge technologies. You will work closely with cross-functional teams to deliver innovative solutions that meet the needs of our clients and drive business growth.Responsibilities:Design, develop, and deploy scalable and high-performance software applications using Java, Spring Boot, Angular, SQL, microservice architecture, Cassandra, ELK Stack, and other relevant technologies.Collaborate with cross-functional teams to analyze business requirements, design technical solutions, and implement new features and functionalities.Perform code reviews, unit testing, and debugging to ensure the quality and reliability of the software applications.Continuously research and evaluate new technologies, frameworks, and tools to improve the development process and enhance the performance of the software applications.Participate in agile development methodologies, including sprint planning, stand-up meetings, and retrospectives.Qualifications:Bachelor's degree in Computer Science, Engineering, or related field.5+ years of experience in software development using Java, Spring Boot, Angular, SQL, microservice architecture, Cassandra, ELK Stack, and other relevant technologies.Experience with cloud-based platforms such as AWS, Azure, or Google Cloud Platform.Excellent problem-solving skills and ability to work independently or in a team environment.Strong communication and interpersonal skills to collaborate effectively with cross-functional teams and clients.Experience with DevOps tools such as Jenkins, Docker, Kubernetes, or GitLab is a plus.This position offers relocation assistance if needed and H1B sponsorship. NO C2C.Interested in hearing more? Easy Apply now by clicking the \"Apply Now\" button.Employers have access to artificial intelligence language tools (“AI”) that help generate and enhance job descriptions and AI may have been used to create this description. The position description has been reviewed for accuracy and Dice believes it to correctly reflect the job opportunity.JobotComputer/IT At Jobot, we are disrupting the recruiting and staffing space by:Using the latest AI technology to match jobs to job seekers.... Overall Rating : 4.7 Recruiter Details Confidential\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "37_Urgent Need: Azure Platform Admin, 100% Remote": "SAPNA,\nITECS\nsapna@itecsus.com\nReply to: sapna@itecsus.com\nUrgent need from Infocepts. Only US Citizens. Phone + Video interview. . 100% Remote from US location. Primary Skills: Technologies/Tools: Azure Infra, Azure Virtual Machines, Azure Resource Manager, Azure Blob Storage, PowerShell DSC, Azure Automation, Azure Active Directory, and Azure Site Recovery, Azure Governance and Best Practices (Role Based Access Control, Networking Architectures, Cost Management controls, etc. ) Job Title: Azure Platform Admin Work Location: Onshore in USA – 100% Remote Key Result Areas and Activities: Thought Leadership – Build and share experience and evidence based thought leadership in the Azure, Cloud and Big Data domain through various channels and provide inputs on creating and enhancing enduring solutions for client. Solutions and Sales Support – Support pre-sales activities including conducting discovery workshops, developing point of views/solutions/scoping, writing proposals, and supporting sales and marketing enablement for Azure, Cloud and Big Data related technologies. Lead the solution development for project. Consulting for New and Existing Clients – Provide advisory consulting to new and existing customers, support delivery hand-offs, address unmet needs, and manage client expectations for their Azure, Cloud and Big Data technologies. Work and Technical Experience: At least 12 years of IT experience; Minimum 4 - 7 years of experience on Azure related projectsConsulting experience with large-scale implementations on Microsoft Azure modernization initiativesExperience with Architecture creation and delivery which includes understanding requirements, formulating design, and communicating the architecture along with TCO roadmapExperience with Modern Data Architectures, DevOps & Agile engineering practicesExperience in Greenfields implementation of Azure Infra, Networks, Storage, Apps and Azure DevOpsExperience with Azure Resource Manager, Resource Groups, Virtual Networks, Azure Virtual Machines, Azure Blob Storage, PowerShell DSC, Azure Automation, Azure Active Directory, and Azure Site RecoveryExperience in building Batch/Micro-batch/Real time data pipelines using native Azure services for Data Integration, Data Processing & Data Consumption including but not limited to Azure HDInsight, Azure Databricks, Azure Portal, Log Analytics, Azure Data Factory, Azure Data Catalog, Power BI, Azure Search, Azure Functions, Azure Stream Analytics and Azure Event HubExperience with Azure Governance and Best Practices (Role Based Access Control, Networking Architectures, Cost Management controls, etc. )Unified data governance experience with Microsoft PurviewKnowledge of Azure Security components such as Azure Security Centre, Security Operations, Microsoft DefenderExperience in developing and deploying Cloud Native Applications using Azure PaaS Capabilities (App Services Plans, Key Vault, SQL Azure DB, Azure Functions, Containers, AKS, Logic Apps, Service Bus, Event Grid, API Management)Experience with programming languages such as Python, Scala, and JavaWorking knowledge on Architecture design, Modelling, prototyping, and benchmarking of DataStore/ EDW solutionsData Modelling experience on leading Cloud SQL database – Snowflake for BI consumptionGood to have – SAP ECC data model understandingQualifications: Bachelor’s degree in computer science, engineering, or related field (Master’s degree is a plus)Demonstrated continued learning through one or more technical certifications or related methods ---------------------------------------------------------------------------------------------------------------------------Please follow the submission format table provided and ensure all required information is included with each submission with resume. Incomplete submissions will be disqualified. Candidate Legal Name (As per Documents) Summary Year of experience in each skillset: Email Address Phone Number Work Authorization Current Location For non-local, Relocation (Yes/No) Pay Rate Current working status Reason for change LinkedIn Profile Availability for Interview (Please provide 03 time slots) Availability for Joining the project\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "38_Apex Requirements": "Pravalika,\nApex global\npravalika@apexglobalusa.com\nReply to: pravalika@apexglobalusa.com\nWe are looking for SSIS and SQL Developer*profiles for *REMOTE positionInterested candidates OverviewWe are seeking a talented SSIS and SQL Developer with exceptional skills in creating and optimizing stored procedures. The ideal candidate will have extensive experience with version control using Git and Azure DevOps, and proficiency in Visual Studio Code. This role involves working on complex data integration projects, maintaining and enhancing our SQL Server database, and ensuring the seamless flow of data across various systems. Responsibilities- Design, develop, and implement SSIS packages for ETL processes.- Create, optimize, and maintain SQL Server stored procedures, functions, and triggers.- Collaborate with the development team to design and deploy database objects, including tables, views, indexes, and schemas.- Use Git and Azure DevOps for version control and continuous integration/continuous deployment (CI/CD) processes.- Utilize Visual Studio Code for code development, debugging, and version control integration- Perform data analysis and troubleshooting to resolve data-related issues.- Ensure data integrity and security across all databases and applications.- Work closely with business analysts and stakeholders to understand data requirements and deliver solutions.- Participate in code reviews, providing constructive feedback to peers.- Stay up-to-date with the latest industry trends and technologies to ensure best practices. Qualifications- Proven experience as an SSIS and SQL Developer.- Strong expertise in writing and optimizing SQL stored procedures.- Proficiency in Git and Azure DevOps for version control and CI/CD.- Experience using Visual Studio Code for development and debugging.- Solid understanding of database design, normalization, and indexing.- Excellent problem-solving skills and attention to detail.- Strong communication and collaboration skills.- Ability to work in a fast-paced, dynamic environment.- Bachelor's degree in computer science, Information Technology, or a related field is preferred. Preferred Skills- Experience with other data integration tools and technologies.- Knowledge of cloud platforms, particularly Azure.- Familiarity with other programming languages and frameworks.- Understanding of Agile methodologies and practices.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "43_FullStack Developer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nJob Title: Full stack EngineerLocation: Edison, NJ - HybridType: Contract Job description:~7-10 years of engineering experienceMaster's degree in Computer Science, Engineering, or a related technical field is a plusExperience deploying genAI applications is a plusExperience programming with Python and another language like Scala, C/C++, Java, C#, Go, or similar programming language.Experience with SQL or NoSQL databases (e.g., PostgreSQL, Snowflake, Redis, Amazon Redshift)Experience in deploying serverless data pipelines through containerization and terraform orchestrationExperience with Cloud platforms and services (AWS, Azure, Google Cloud Platform)Experience with DevOps, CI/CD, Git, Github ActionsExperience with modern ETL compute and workflow orchestration (e.g., Airflow, Luigy, Metaflow, Kubeflow, or any other)Strong computer science fundaments in data structures, algorithms, automated testing, object-oriented programming, performancecomplexity, and implications of computer architecture on software performance VDart Group, a global leader in technology, product, and talent management, empowers businesses with comprehensive solutions through our four distinct, industry-leading business units. With a diverse team of over 4,000 professionals across 13 countries, we deliver strong results across various industries, including Fortune 500 companies.Leveraging our deep expertise as a global provider of resources and solutions, we serve a wide range of industry verticals, including BFSI, Automotive, Healthcare, Mobility, Energy, Life Sciences, Manufacturing, Consumer Industries, and Technology.With over 16 years of experience, VDart has evolved to meet the needs of leading technology brands, placing and training more than 20,000 professionals and shaping the industry's future.Our continuous reinvention, providing resources for IT solutions and unique digital solutions, has positioned us as a top growth leader in digital talent management and technology consulting.Committed to \"People, Purpose, Planet,\" we prioritize social responsibility and sustainability, as evidenced by our EcoVadis Bronze Medal Certification and participation in the UN Global Compact.Our dedication to delivering strong results has earned us recognition as a trusted advisor for businesses seeking to drive innovation and growth, including many Fortune 500 companies.Join our network! Partner with VDart Group to leverage our global network, industry expertise, and proven track record with a diverse clientele.Employers have access to artificial intelligence language tools (“AI”) that help generate and enhance job descriptions and AI may have been used to create this description. The position description has been reviewed for accuracy and Dice believes it to correctly reflect the job opportunity.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "44_Lead Analytics Engineer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\n100% Remote, Hypergrowth Analytics SaaS, Equity part of total compensationThis Jobot Job is hosted by: Duran WorkmanAre you a fit? Easy Apply now by clicking the \"Apply Now\" button and sending us your resume.Salary: $150,000 - $175,000 per yearA bit about us:Our company is looking for a seasoned and dynamic Lead Analytics Engineer to join our innovative and fast-paced technology team. The successful candidate will be a key player in the design, creation, deployment, and maintenance of our analytics infrastructure. This role is vital to our organization as it directly influences our ability to make data-driven decisions. The position requires a deep understanding of modern data architecture, API, DBT, Snowflake, and Python. By joining our team, you will be part of a collaborative environment where your expertise will be valued and your innovative ideas will help shape the future of our company.Why join us?Innovative Technology100% Remote teamsGlobal presenceGreat total rewards package w/ EquityJob DetailsResponsibilities:Lead and manage the development and execution of an analytics platform that supports our business intelligence and data science teams.Collaborate with cross-functional teams to understand their data needs and translate them into technical requirements.Design and implement data models, data collection systems, data analytics, and other strategies that optimize statistical efficiency and quality.Develop and maintain scalable data pipelines and build out new API integrations to support continuing increases in data volume and complexity.Collaborate with data analysts and data scientists to build and optimize 'big data' pipelines, architectures, and data sets.Utilize DBT to transform data in our warehouse and ensure data is ready for analysis.Use Snowflake to manage, store, and analyze data, ensuring it is available to stakeholders in a timely manner.Drive the collection of new data and the refinement of existing data sources.Develop processes and tools to monitor and analyze model performance and data accuracy.Qualifications:Bachelor's degree in Computer Science, Engineering, Mathematics, or a related field.Minimum of 5 years of experience in a data engineering role with a proven track record of successful data platform implementations.Proficiency with Python, API, DBT, and Snowflake.Experience with data architecture, data modeling, schema design, and software development.Strong understanding of analytics and data platforms in the cloud (AWS, Google Cloud Platform, Azure).Strong project management and organizational skills.Excellent problem-solving and analytical skills, with the ability to create sophisticated solutions to complex problems.Strong communication skills, with the ability to explain complex technical concepts to non-technical stakeholders.Ability to work independently and as part of a team, on multiple projects simultaneously.Experience with machine learning algorithms and statistical modeling techniques is a plus.If you are a driven, results-oriented individual with a passion for data and analytics, we would love to hear from you. This is a fantastic opportunity to play a pivotal role in a fast-growing company, where your contributions will have a direct impact on our strategic decisions and our success. Apply today!Interested in hearing more? Easy Apply now by clicking the \"Apply Now\" button.Employers have access to artificial intelligence language tools (“AI”) that help generate and enhance job descriptions and AI may have been used to create this description. The position description has been reviewed for accuracy and Dice believes it to correctly reflect the job opportunity.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "45_Business Intelligence Developer at  Fully Onsite (Detroit, MI)": "Raj Khan,\nConvextech INC.\nraj@convextech.com\nReply to: raj@convextech.com\nHi,Hope you are doing good.!!Please let me know if you are interested in the below position.!! Position: Business Intelligence DeveloperLocation: Fully Onsite (Detroit, MI)Duration: 6 months contract Visa: Only USC/GCInterview: Video/Skype Job Description: Responsibilities:Develop, design, and maintain Power BI reports and dashboards to support business decision-making processes.Work with multiple data sources to gather, analyze, and interpret complex data sets.Optimize and improve existing Power BI reports for better performance and user experience.Collaborate with cross-functional teams to understand their data needs and deliver effective BI solutions.Write and optimize SQL queries to extract and manipulate data from various databases.Design and implement ETL processes using Python to ensure data is accurately and efficiently loaded into the data warehouse.Utilize Python to automate data processing tasks and enhance data analysis capabilities.Contribute to software development projects as needed, leveraging your programming skills.Provide support and troubleshooting for BI-related issues and ensure data integrity and accuracy.Stay updated with the latest trends and best practices in BI and data analytics. Required Experience and Skills:Bachelor's degree in Computer Science, Information Technology, or a related field.Minimum of 3 years of experience with Power BI.Minimum of 3 years of strong experience with SQL.Experience with Python programming, specifically for ETL processes, is highly desirable.Proficient in designing and implementing ETL processes.Previous experience in software development is a plus.Healthcare industry experience is a significant advantage.Strong analytical and problem-solving skills.Excellent communication and interpersonal skills.Ability to work independently and as part of a team.Knowledge of data warehousing concepts and best practices.Familiarity with cloud platforms such as Azure or AWS.Understanding of data visualization best practices. Best Regards Md. Raj khanUS IT Recruiter ConvexTech Inc.Email: raj@convextech.comLinkedin – linkedin.com/in/md-raj-khan-9b1498204\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "47_Pyspark Developer - New York,NY &amp; Wilmington, DE- Day 1 Onsite": "dhana,\nxforia\ndhana@xforia.com\nReply to: dhana@xforia.com\nExperience in building Spark Streaming process. Proficient in understanding distributed computing principles. Experience in managing Hadoop cluster with all services. Experience with Nosql Databases and Messaging systems like Kafka. Designing building installing configuring and supporting Hadoop Perform analysis of vast data stores. Good understanding of cloud technology. Must have strong technical experience in Design Mapping specifications HLD LLD. Must have the ability to relate to both business and technical members of the team and possess excellent communication skills. Leverage internal tools and SDKs, utilize AWS services such as S3, Athena, and Glue, and integrate with our internal Archival Service Platform for efficient data purging. Lead the integration efforts with the internal Archival Service Platform for seamless data purging and lifecycle management. Collaborate with the data engineering team to continuously improve data integration pipelines, ensuring adaptability to evolving business needs.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "48_Senior Java Specialist at Chicago, IL (Hybrid)": "Raj Khan,\nConvextech INC.\nraj@convextech.com\nReply to: raj@convextech.com\nHi,Hope you are doing good.!!Please let me know if you are interested in the below position.!! Position: Senior Java SpecialistLocation: Chicago, IL (Hybrid)Duration: 6 months contractVisa: Only USC/GCInterview: Video/Skype Job Description: Key Responsibilities:Design and Development: Lead the design, development, and implementation of robust and scalable Java applications on AWS and OCP.Project Delivery: Ensure the successful delivery of projects using TDD, adhering to best practices and industry standards.Technical Leadership: Provide technical leadership and mentorship to junior developers, fostering a collaborative and innovative development environment.Cloud Integration: Integrate Java applications with AWS services, ensuring optimal performance, scalability, and security.Container Management: Utilize OpenShift Container Platform for the deployment, management, and orchestration of containerized applications.Code Quality: Conduct thorough code reviews, identify areas for improvement, and ensure adherence to coding standards and best practices.Collaboration: Work closely with cross-functional teams, including architects, product owners, and QA engineers, to define and refine requirements and deliver high-quality solutions.Required Experience:Java: 7 to 8 years of professional experience in Java development, with a strong understanding of object-oriented programming principles and design patterns.AWS: 5 to 6 years of hands-on experience with AWS services, including EC2, S3, Lambda, RDS, and more.OCP: 2 to 3 years of experience with the OpenShift Container Platform, including deployment, management, and orchestration of containerized applications.TDD: 2 to 3 years of experience with Test Data Driven Development, including writing and maintaining unit tests, integration tests, and ensuring code coverage.Qualifications:Bachelor's degree in Computer Science, Engineering, or a related field.Strong problem-solving skills and the ability to think critically and creatively.Excellent communication and interpersonal skills, with the ability to collaborate effectively with team members and stakeholders.Ability to work in a fast-paced, dynamic environment and manage multiple priorities.Preferred Skills:Familiarity with other container orchestration platforms such as Kubernetes.Experience with CI/CD pipelines and related tools (e.g., Jenkins, GitLab CI/CD).Knowledge of microservices architecture and related technologies.Certification in AWS or OpenShift. Best Regards Md. Raj khanUS IT RecruiterConvexTech Inc.Email: raj@convextech.comLinkedin – linkedin.com/in/md-raj-khan-9b1498204\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "49_Senior Backend Engineer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nBuild out modern platforms supporting the short term rental SaaS space 100% RemoteThis Jobot Job is hosted by: Charles SimmonsAre you a fit? Easy Apply now by clicking the \"Apply Now\" button and sending us your resume.Salary: $130,000 - $175,000 per yearA bit about us:This mid-stage SaaS startup in the short term rental space is working on modernizing a production environment supporting a revenue generating platform with web and mobile applications that is experiencing rapid growth and scaling issues. The engineering team has 11 members and is hoping to fill 3 more spots by the end of the year. This team values engineers that focus on code quality and ownership, following methodical best practices to deliver scalable, highly performant systems that will last long term. Anyone that values a remote first culture and enjoys working on modern software engineering for consumer facing SaaS products should apply!Why join us?100% TelecommuteSalary $130-165k baseSignificant equity vesting over 4 yearsComprehensive health, vision, and dental coverage401k with employer matchJob DetailsThe Senior Backend Engineer will be responsible for building out the modernized replacement for an existing legacy monolith supporting the functions of the web and mobile products to the business. Candidates should have experience with legacy architecture as well as building out modern, microservices architecture in a serverless cloud environment. Skills/ Tech Stack:Golang, gRPC, GraphQLRuby on Rails, RESTPostgreSQLTypeScript, React Native, Node, Next.js, CypressAWS, Docker, Kubernetes, Terraform, GitHub ActionsTest Driven Development (TDD)Interested in hearing more? Easy Apply now by clicking the \"Apply Now\" button.Employers have access to artificial intelligence language tools (“AI”) that help generate and enhance job descriptions and AI may have been used to create this description. The position description has been reviewed for accuracy and Dice believes it to correctly reflect the job opportunity.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "50_Senior Azure DevOps Engineer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\n:Seeking Senior Azure DevOps Engineer with experience working with cloud platforms and has a passion for automation and developing DevOps best practices. This person will drive DevOps automation and containerization strategies that align with DevOps principles and standards. DevOps engineer will collaborate with Product owners, developers, cloud engineers, DevOps engineers and operations to plan, design, test and deliver pipelines and infrastructure using Continuous Integration/Continuous Delivery (CI/CD) model.This position is eligible for the TalentQuest employee referral program. If an employee referred you for this job, please apply using the system-generated link that was sent to you.Responsibilities:Hands on automation skills designing, building, and troubleshooting CI/CD pipelines and Infrastructure as Code of enterprise applicationsBuild and support highly available CICD tools for pipelines and related integrationsDesign, build, and implement reusable YAML pipelines in Azure DevOps while adhering to best practicesPerform analysis of DevOps practices, identify gaps and impediments for continuous integration and deliveryEngage with information Security and augment the CI/CD framework with DevSecOps and standardized security tools and controlsDevelop and apply quality controls and gates to the build, test, and deploy process while establishing Definition of Ready and Definition of Done to ensure quality of deliveryBe a member of Center of Excellence for DevOps practices and develop policies, standards, guidelines, governance for both CI/CD operations and for work of developersProvide guidance, coaching, training on build, test, and release management best practicesCollaborate on and provide input into the CICD roadmap, identify gaps and dependenciesOnboard agile product teams to the CICD framework and perform DevOps health assessment on pipelines, identify gaps and execute recommendationsWork directly with business leadership to understand data requirements; propose and develop solutions that enable effective decision-making and drives business objectivesPerform other duties as assignedQualifications:A Bachelor's Degree in Computer Applications, Computer Science, Engineering, related field or equivalent experience5+ years hands on experience with Microsoft Azure or similar Cloud native offerings5+ years experience in creating continuous integration and delivery pipelines leveraging cloud native architectures on Microsoft Azure Cloud5+ years' Experience with agile delivery, SAFe, and DevOps frameworks5+ years' Experience with Azure DevOps Tools for plan, build, test, release and monitorExperience with Docker, Kubernetes, PowerShell scripting, Bash, YAML, Json, GIT, Rest API, and Azure Resource Management (ARM) templatesExperience with Git flow branching strategyHands on experience with implementing standards and best practices for the CI/CD frameworkKnowledge of security scanning/monitoring tools and integration with pipelineExtensive experience with scripting and debugging on Linux and Windows environmentsUnderstanding of Test Automation tools and scripts to facilitate Test Driven DevelopmentExperience with Automated Change Management using modernized solutions like ServiceNowDesired:Microsoft Certified: Azure Solutions Architect Expert or Azure DevOps Engineer Expert or Azure Developer AssociateExperience with Dynamics CRM platformExperience with Microservices deployment and release managementDemonstrated understanding of ADLS, ADF, Databricks, and SQL is a plusDemonstrated experience in Microsoft Dynamics 365 customization, configuration, deployment, and usage (experience migrating Dynamics from environment to environment is a plus)Experience using Azure DevOps REST API to enhance DevOps practicesHours: Monday - Friday, 8:00AM - 4:30PMLocation: 820 Follin Lane, Vienna, VA 22180 | 5550 Heritage Oaks Dr. Pensacola, FL 32526 | 141 Security Dr. Winchester, VA 22602 | RemoteJob postings are subject to close early or extend out longer than the anticipated closing date at the hiring team's discretion based on qualified applicant volume.About Us:Navy Federal provides much more than a job. We provide a meaningful career experience, including a culture that is energized, engaged and committed; and fierce appreciation for our teams, who are rewarded with highly competitive pay and generous benefits and perks.Best Companies for Latinos to Work for 2024Computerworld Best Places to Work in ITForbes 2024 America's Best Large EmployersForbes 2023 The Best Employers for New GradsFortune Best Workplaces for Millennials 2023Fortune Best Workplaces for Women 2023Fortune 100 Best Companies to Work For 2024Military Times 2023 Best for Vets EmployersNewsweek Most Loved WorkplacesRipplematch Campus Forward Award - Excellence in Early Career HiringYello and WayUp Top 100 Internship ProgramsFrom Fortune. 2024 Fortune Media IP Limited. All rights reserved. Used under license. Fortune and Fortune Media IP Limited are not affiliated with, and do not endorse products or services of, Navy Federal Credit Union.Equal Employment Opportunity: Navy Federal values, celebrates, and enacts diversity in the workplace. Navy Federal takes affirmative action to employ and advance in employment qualified individuals with disabilities, disabled veterans, Armed Forces service medal veterans, recently separated veterans, and other protected veterans. EOE/AA/M/F/Veteran/Disability EOE/AA/M/F/Veteran/DisabilityHybrid Workplace: Navy Federal Credit Union is a hybrid workplace, and details will be discussed during your interview process.Disclaimers: Navy Federal reserves the right to fill this role at a higher/lower grade level based on business need. An assessment may be required to compete for this position. Job postings are subject to close early or extend out longer than the anticipated closing date at the hiring team's discretion based on qualified applicant volume. Navy Federal Credit Union assesses market data to establish salary ranges that enable us to remain competitive. You are paid within the salary range, based on your experience, location and market position.Bank Secrecy Act: Remains cognizant of and adheres to Navy Federal policies and procedures, and regulations pertaining to the Bank Secrecy Act.Navy Federal Credit Union\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "51_Senior Software Developer - Infotainment Simulation": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nThe Software Defined Vehicle will increase the vehicle s compute capability, be connected, and allow for faster software development cycles. As a Software Simulation Developer, you will be on the forefront of realistic automotive software-in-the-loop simulation environments creating highly optimized, largely automated, high-fidelity vehicles on demand which are capable of running thousands of simultaneous scenarios on cloud compute.The simulations support algorithm development and validation of the Software Defined Vehicle architecture and protocols as well as algorithm development of hands-free driving in all situations, active safety features, in-vehicle Infotainment, and embedded control among others. The main areas of focus are controller virtualization, bus communication, optimization, HMI, and sensor modelling. You will be working cross-collaboratively with many teams to integrate these systems into a wider CI/CD toolchain and data analytics pipeline.Hybrid: This role is categorized as hybrid. This means the successful candidate is expected to report onsite at the GM Global Technical Center - Sloan Engineering Center at least three times per week minimum or other frequency dictated by the business. This job may be eligible for relocation benefits.Key ResponsibilitiesWork within an Agile environment to define, plan, and analyze user-stories to meet the team s strategic objectivesCombine engineering analysis with strong computer science fundamentals to create accurate high fidelity simulation platforms to allow developers to test development controller codeWork collaboratively with multiple teams to deliver end-to-end products and features, seeing them through from conception to delivery with a focus on (internal) customer ease-of-useDesign and implement a virtual controller environment for Android developers, QNX developers, and HMI developers within a larger vehicle simulation environmentEnsure deliverables are complete as per milestones with excellenceIdentify and implement areas of efficiency to the process and the product when scaling upInvestigate simulation integration problems and provides technical input in problem resolutionMaintain technical documentation to reflect accurate and current production installationsLearn new technical concepts and practices quickly and apply them across multiple types of applications and softwareQualificationsBachelor Degree in Software, Computer Engineering or Computer Science5+ years of working experience with C++3+ years of working experience with Android developmentKnowledge of containerization, virtual machines, orchestration, and integration to a CI/CD pipelineExperience with object-oriented programming, modern design patterns and writing scalable reusable codeExtensive experience with the full software development lifecycle (software requirements, design, coding, verification, support)Knowledge of performance optimization techniques and memory management for Android applicationsKnowledge of Python or other scripting languagesExperience working on large volumes of data in a real-time, or faster than real-time, discrete environmentKnowledge of digital signal processing, timing, scheduling, and multi-threaded programmingExperience working with Scrum/Agile software development process and toolsFamiliar with High Performance Computers, Cloud Compute and/or GPU Programming an assetFamiliarity with Camera, LiDAR, and Radar automotive sensors an assetAble to work in a team as well as independentlyMust possess excellent communication skillsAdditional GM DOES NOT PROVIDE IMMIGRATION-RELATED SPONSORSHIP FOR THIS ROLE. DO NOT APPLY FOR THIS ROLE IF YOU WILL NEED GM IMMIGRATION SPONSORSHIP (e.g., H-1B, TN, STEM OPT, etc.) NOW OR IN THE FUTURE.Compensation: The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or WashingtonCompensation: The expected base compensation for this role is: $93,400 - $149,200 Actual base compensation within the identified range will vary based on factors relevant to the position.Bonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.Benefits: GM offers a variety of health and wellbeing benefit programs. Benefit options include medical, dental, vision, Health Savings Account, Flexible Spending Accounts, retirement savings plan, sickness and accident benefits, life insurance, paid vacation & holidays.#LI-EL1About GMOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.Why Join UsWe aspire to be the most inclusive company in the world. We believe we all must make a choice every day individually and collectively to drive meaningful change through our words, our deeds and our culture. Our Work Appropriately philosophy supports our foundation of inclusion and provides employees the flexibility to work where they can have the greatest impact on achieving our goals, dependent on role needs. Every day, we want every employee, no matter their background, ethnicity, preferences, or location, to feel they belong to one General Motors team.Benefits OverviewThe goal of the General Motors total rewards program is to support the health and well-being of you and your family. Our comprehensive compensation plan incudes, the following benefits, in addition to many others:Paid time off including vacation days, holidays, and parental leave for mothers, fathers and adoptive parents;Healthcare (including a triple tax advantaged health savings account and wellness incentive), dental, vision and life insurance plans to cover you and your family;Company and matching contributions to 401K savings plan to help you save for retirement;Global recognition program for peers and leaders to recognize and be recognized for results and behaviors that reflect our company values;Tuition assistance and student loan refinancing;Discount on GM vehicles for you, your family and friends.Diversity InformationGeneral Motors is committed to being a workplace that is not only free of discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that workforce diversity creates an environment in which our employees can thrive and develop better products for our customers. We understand and embrace the variety through which people gain experiences whether through professional, personal, educational, or volunteer opportunities. GM is proud to be an equal opportunity employer.We encourage interested candidates to review the key responsibilities and qualifications and apply for any positions that match your skills and capabilities.Equal Employment Opportunity StatementsGM is an equal opportunity employer and complies with all applicable federal, state, and local fair employment practices laws. GM is committed to providing a work environment free from unlawful discrimination and advancing equal employment opportunities for all qualified individuals. As part of this commitment, all practices and decisions relating to terms and conditions of employment, including, but not limited to, recruiting, hiring, training, promotion, discipline, compensation, benefits, and termination of employment are made without regard to an individual's protected characteristics. For purposes of this policy, protected characteristics\" include an individual's actual or perceived race, color, creed, religion, national origin, ancestry, citizenship status, age, sex or gender (including pregnancy, childbirth, lactation and related medical conditions), gender identity or gender expression, sexual orientation, weight, height, marital status, military service and veteran status, physical or mental disability, protected medical condition as defined by applicable state or local law, genetic information, or any other characteristic protected by applicable federal, state or local laws and ordinances. If you need a reasonable accommodation to assist with your job search or application for employment, email us at or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying.General Motors\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "52_Oracle Fusion Cloud HCM Cloud Developer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nAre you looking for the next exciting project opportunity with a great company? Our professional recruiting staff at CC Pace is here to support you in every step of the process! We have been in business for nearly four decades and have deep roots in the Washington, DC, metro area. Our direct client relationships with companies in various industries and sizes help us find the right opportunity for our candidates. We offer competitive rates, healthcare & dental, 401k, FSA, LTD, lots of voluntary benefits, and tons of discount perks. Our team is standing by, ready to help you get started today!Description:Oracle Fusion Cloud HCM Cloud Developer is a technical role that provides project coordination technical expertise and contributes to the support, maintenance, and enhancement of Oracle HCM Cloud modules (Recruiting, Benefits, Time & Labor, Payroll, Profile Management, and Performance Management.) Experience in product personalization, data integration, data conversion, and reports development.This resource will serve as a technical expert to the business to manage the development of new system functionality and system upgrades. It must have experience working with at least two modules in Oracle HCM Cloud and demonstrated experience in identifying, creating, documenting, and implementing solutions that enhance business and system operations.This resource should have experience in Oracle HCM Cloud advanced tools such as OIC, HCM Extracts, Fast Formula, HDL, BI Publisher reports, OTBI reports, Redwood Page Composer, Page Configurator, REST APIs, SOAP, Webservices, Fast Formula, Oracle HCM Application Security.Responsibilities:To participate in Oracle HCM Cloud-related projects, production support, and testing efforts to ensure solutions meet user requirements.To participate, coordinate, and perform the functional/technical tasks related to the development lifecycle of projects, including requirements definition, analysis, fit/gap resolution, process design and implementation, functional design, configuration, testing, training, and validation.Perform research and analysis to troubleshoot system issues.Identify and analyze opportunities for new and improved processes, data, or technology. After considering best practices, alternatives, and implications, present recommendations.Stay current on Oracle's quarterly HCM upgrades/enhancements/improvements.Collaborate with end users and technical resources to build solutions.Responsible for ensuring thorough testing execution, including identifying comprehensive test cases, preparing test scripts and test plans, executing scripts, and documenting results.Ensure compliance with ETS standards and best practices.Work closely with the Business Analysts and HR Business teams to gather requirements for reports, interfaces, extensions, and integrations.Providing strong subject matter expertise to identify and translate business and system requirements into design artifacts and documents.Build the integrations for HCM touch points utilizing all available integration services (The primary focus for this role will be OIC- Oracle Integration Cloud).Collaborating with project and delivery managers to provide estimates and develop the overall implementation solution plan for area of expertise, interfacing and coordinating tasks with internal and external resources.Develop functional and technical design and documentation for Oracle Applications dependent data conversions, interfaces, custom reporting, and custom applications, including the use of documented revision control.Participate in designing, developing, and maintaining Conversions, Modifications/Customizations, and Interfaces to/from Oracle's Suite of Business Applications.Open, manage, and resolve Oracle Service Requests with Oracle Support.Experience/QualificationsBachelor's degree in information technology, Computer Science, or other related fieldMinimal 5 years experience with Oracle Cloud HCMExperience supporting Oracle HCM Cloud modules (HR-core, Recruiting, Benefits, Time & Labor, Payroll, Profile Management, and Performance Management).Proven experience gathering and analyzing data and creating functional documentation. Including business process flows, requirements documents, test plans, and test scripts.Proven experience testing and documenting results.Expertise with Oracle Applications, Cloud Infrastructure/Solutions, and experience in SQL (Oracle or MS SQL).Expertise in the knowledge of BI Publisher (BIP) and OTBI reports development, Interface development and troubleshooting, Application security roles, and Workflow.Hands-on experience configuring and implementing an enterprise integration architecture solution using OIC adapters (SOAP, REST, FTP, and other pre-built adapters) based on data mapping requirement.Understanding leveraging Oracle SHDL and HDL capabilities to import data into Oracle Fusion Cloud via OIC.Willing to learn a range of business or technical specialties based on business needs.Experience with Agile software development practices, including SAFe, Scrum, Azure DevOps, Peer Review, GitHub, and CI/CD.Excellent interpersonal, communication, and presentation skills.Demonstrated ability to convey complex information in a clear and concise manner.Proficiency in Microsoft applications, including Word, Excel, and Visio.Desired Qualifications and Education Requirements:Bachelor's degree in information technology, Computer Science, or other related field.Knowledge of banking/financial industry trends, products, and services (desired).Technical certifications for Oracle Cloud HCM and Oracle Cloud Infrastructure (desired).An Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against based on disability. EEO IS THE LAW CC Pace invites any applicant and/or employee to review the Company s written Affirmative Action Plan. This plan is available for inspection upon request. If you are an individual with a disability and would like to request a reasonable accommodation as part of the employment selection process, please contact us.CC Pace\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "53_DevOps Engineer in Plano, TX": "Kevin Mathew,\nArthur Grand Technologies\nteamkevin@arthurgrand.com\nReply to: teamkevin@arthurgrand.com\nTitle: DevOps EngineerLocation: Plano, TX Job Description:Excellent working experience in CI/CD to Setup CI/CD pipeline to achieve fully automated CI/CD process.Troubleshoot and rectify build pipeline issues.Schedule automated build and deployment and execute ad-hoc build request by AD teamHands-on knowledge of Bit-bucket, GIT commands and branching strategies. Other Skills:Knowledge of Unix commands required for day to day operations and troubleshooting.Scripting knowledge for automation.Knowledge of webapps (weblogic, Tomcat, Apache , IBM HTTP etc) and their troubleshooting.Working knowledge of schedulers ( control M, Autosys etc).SSL/TLS certificate management. Thanks & RegardsKevin Mathew | Associate Team Lead Arthur Grand Technologies IncSBA 8(a) Certified Minority Small Business | Certified Minority Business Enterprise by NMSDCArthur Grand Technologies is an Equal Opportunity Employer (including disability/vets)\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "54_Senior Software Developer": "Pallavi,\nnss\nrec1@nityainc.com\nReply to: rec1@nityainc.com\nResponsibilities for this PositionLocation: USA IA Home Office (IAHOME)Full Part/Time: Full timeJob Req: RQ178315Type of Requisition:RegularClearance Level Must Currently Possess:NoneClearance Level Must Be Able to Obtain:NoneSuitability:Public Trust/Other Required:OtherJob Family:Software DevelopmentJob Qualifications:Skills:JavaScript, Microservices Architecture, RESTful Web Services, Software Development, Spring BootCertifications:Experience:5 + years of related experienceUS Citizenship Required:YesJob Description:Senior Software Developers- Java, REST API'sSoftware Developers are an integral part of the team here at GDIT that supports our client. You will be directly working on building a new microservices-based solution to assist millions of students pursue the dream of higher education. This is an exciting opportunity creating a new cloud-based application while being a part of a DevSecOps integration. Your ability to develop in JAVA and create REST API's are just the skills we need to deliver this solution to our customer. Communication is important within our organization; we use the Scaled Agile Framework (SAFe) to empower our development team.Your day-to-day impact:Creating maintainable, adaptable, scalable, defect-free micro services based code using software development best practices and coding standards (i.e., software reuse, refactoring, continuous integration, test automation, secure development, and test driven development)Working as a member of a scrum team to develop, integrate, and deploy high quality reusable, testable, and efficient code including Microservices with Java, Spring Boot, and REST API'sDeveloping microservices that include RESTful services using Spring Framework (IoC, MVC, Transactions, Security, and Batch)Writing Unit Test frameworks (JUnit, Mocking frameworks), code coverage, and code review and integrating work with GitLabWorking within a SAFe environment that includes consistent leadership support, continued learning education, refining user stories, providing internal and customer demonstrations of developed codeContributing within a SAFe environment including the Daily scrum, Sprint Planning, Sprint Retrospectives, Backlog grooming, Sprint/System Demos, PI Planning, and Inspect & Adapt events.Required Skills/Experience:5+ of related experience in software developmentExperience with JAVA and developing/maintaining backend APIs.Knowledge of REST API, JSON.Experience using API test cases in SOAP UI, PostMan, or ReadyAPI.Experience with common web development frameworks (Angular, Docker, React, Spring, Node.js, jQuery, Microservice Design, etc.)Excellent interpersonal skills including courtesy, professionalism, and a cooperative attitudeExcellent written and verbal communications skillsBachelor's degree in Computer Science, Engineering, or related technical discipline, or the equivalent combination of education, technical training, or work/military experience.U.S. Citizen with existing or the ability to pass a Public Trust background investigationDesired Skills/Experience:Federal Student Aid systems experience preferred.Experience with Atlassian suite of tools (e.g., Jira, Confluence) or other issue/change tracking software.Experience with GitLab DevOps/CI/CD platform.Experience with an IDE such as eclipse.GDIT takes care of their employees. We are a team. You will be heard and treated fairly. Our people are our strength, and we are proud of what we can do. Our work has meaning and impact on the world around us, we invite you to be part of this change and look forward to the solutions you provide.The likely salary range for this position is $92,331 - $116,237. This is not, however, a guarantee of compensation or salary. Rather, salary will be set based on experience, geographic location and possibly contractual requirements and could fall outside of this range.Scheduled Weekly Hours:40Travel Required:Less than 10%Telecommuting Options:RemoteWork Location:Any Location / RemoteAdditional Work Locations:Total Rewards at GDIT:Our benefits package for all US-based employees includes a variety of medical plan options, some with Health Savings Accounts, dental plan options, a vision plan, and a 401(k) plan offering the ability to contribute both pre and post-tax dollars up to the IRS annual limits and receive a company match. To encourage work/life balance, GDIT offers employees full flex work weeks where possible and a variety of paid time off plans, including vacation, sick and personal time, holidays, paid parental, military, bereavement and jury duty leave. GDIT typically provides new employees with 15 days of paid leave per calendar year to be used for vacations, personal business, and illness and an additional 10 paid holidays per year. Paid leave and paid holidays are prorated based on the employee's date of hire. The GDIT Paid Family Leave program provides a total of up to 160 hours of paid leave in a rolling 12 month period for eligible employees. To ensure our employees are able to protect their income, other offerings such as short and long-term disability benefits, life, accidental death and dismemberment, personal accident, critical illness and business travel and accident insurance are provided or available. We regularly review our Total Rewards package to ensure our offerings are competitive and reflect what our employees have told us they value most.We are GDIT. A global technology and professional services company that delivers consulting, technology and mission services to every major agency across the U.S. government, defense and intelligence community. Our 30,000 experts extract the power of technology to create immediate value and deliver solutions at the edge of innovation. We operate across 30 countries worldwide, offering leading capabilities in digital modernization, AI/ML, Cloud, Cyber and application development. Together with our clients, we strive to create a safer, smarter world by harnessing the power of deep expertise and advanced technology.We connect people with the most impactful client missions, creating an unparalleled work experience that allows them to see their impact every day. We create opportunities for our people to lead and learn simultaneously. From securing our nation's most sensitive systems, to enabling digital transformation and cloud adoption, our people are the ones who make change real.GDIT is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other protected class. PI243143987\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "55_Java Developer with AWS experience - Chicago, IL - Onsite - Only Locals - (H1b Only)": "PAVITHRA,\nXFORIA\npavithra.s@xforia.com\nReply to: pavithra.s@xforia.com\nSkills: Java, AWS, KubernetesJob Description:Need the resource to work on Multiple applications and also migration activities.Very strong knowledge in Java8 and Java fundamentals.Good knowledge in spring and spring boot, Microservices. Hands on Experience on Cloud technologies and CICD.Experience with messaging and integration frameworks like Kafka, RabbitMQ and ActiveMQ.Knowledge in No-SQL like -Cassandra, MongoDB Preferable Cassandra and Kafka knowledge.Strong skills around object-oriented analysis and design (OOAD), Design principles and Design patterns with ability to trouble shoot and debug an application for any application issues.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "58_Java AWS terraform - New York - Wilmington, DE- Day 1 Onsite": "Riyas,\nXforia Inc\nriyas.d@xforia.com\nReply to: riyas.d@xforia.com\nNote: Do not share below 10 year experience candidates Visa Preferred: H1B, H4, L2. Extensive experience with AWS Cloud Provider and its services like, but not limited to - compute, networks, storage, databases, analytics. Extensive experience in Continuous Integration and Continuous Deployment techniques and tools like Jenkins, Spinnaker, Nexus, etc. Experienced in source code systems and branching strategies. Containerization technologies like Docker and its orchestration using Kubernetes Collaboration, tracking and documentation JIRA, Confluence Infrastructure provisioning using Infrastructure as a Code Terraform Application monitoring and logging - ELK, Grafana, Prometheus, AWS CloudWatch Networking concepts - Access Control Lists, Bastion Hosts, Reverse Proxies, Forward Proxies, Load balancing One or more programming or scripting languages like Shell, Python, Java, Groovy Configuration Management Chef Ansible We advocate cloud platform security and hence you should have experience familiarity with Cloud Network security Secure SDLC practices Data security Authentication and Authorization Web Application Firewall Application workload security using hardening methodologies, vulnerability scanning A good understanding of distributed systems and microservices Previous JPMC experience will be an added advantage. Kindly share the below details for interview schedule purpose:Work Authorization:When did you complete your project:Linked In: Last 4 Digit SSN NO: Interview Availability for next 3days: PP NO:Current location: Willing to Relocate/Travel/Day one onsite(Yes/No): Regards, Riyas DeenRecruitment LeadEmail: Riyas.d@xforia.com |Website: www.xforia.com|\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "59_Pyspark Developer - New York - Wilmington, DE- Day 1 Onsite": "Riyas,\nXforia Inc\nriyas.d@xforia.com\nReply to: riyas.d@xforia.com\nExperience in building Spark Streaming process. Proficient in understanding distributed computing principles. Experience in managing Hadoop cluster with all services. Experience with Nosql Databases and Messaging systems like Kafka. Designing building installing configuring and supporting Hadoop Perform analysis of vast data stores. Good understanding of cloud technology. Must have strong technical experience in Design Mapping specifications HLD LLD. Must have the ability to relate to both business and technical members of the team and possess excellent communication skills. Leverage internal tools and SDKs, utilize AWS services such as S3, Athena, and Glue, and integrate with our internal Archival Service Platform for efficient data purging. Lead the integration efforts with the internal Archival Service Platform for seamless data purging and lifecycle management. Collaborate with the data engineering team to continuously improve data integration pipelines, ensuring adaptability to evolving business needs. Kindly share the below details for interview schedule purpose:Work Authorization:When did you complete your project:Linked In: Last 4 Digit SSN NO: Interview Availability for next 3days: PP NO:Current location: Willing to Relocate/Travel/Day one onsite(Yes/No):Regards, Riyas DeenRecruitment LeadEmail: Riyas.d@xforia.com |Website: www.xforia.com|\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "60_Pyspark Developer - New York,NY &amp; Wilmington, DE- Day 1 Onsite": "dhana,\nxforia\ndhana@xforia.com\nReply to: dhana@xforia.com\nExperience in building Spark Streaming process. Proficient in understanding distributed computing principles. Experience in managing Hadoop cluster with all services. Experience with Nosql Databases and Messaging systems like Kafka. Designing building installing configuring and supporting Hadoop Perform analysis of vast data stores. Good understanding of cloud technology. Must have strong technical experience in Design Mapping specifications HLD LLD. Must have the ability to relate to both business and technical members of the team and possess excellent communication skills. Leverage internal tools and SDKs, utilize AWS services such as S3, Athena, and Glue, and integrate with our internal Archival Service Platform for efficient data purging. Lead the integration efforts with the internal Archival Service Platform for seamless data purging and lifecycle management. Collaborate with the data engineering team to continuously improve data integration pipelines, ensuring adaptability to evolving business needs.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "62_Data Engineer | Hybrid in Plano TX or Mclean VA (LOCAL PROFILES)": "Elender Poosa,\nTekgence\nelender@tekgence.com\nReply to: elender@tekgence.com\nData EngineerJob summaryExperience : 7+ Years ******FACE TO FACE INTERVIEW ***Hybrid in Plano TX or Mclean VA (LOCAL PROFILES)Required Skills : Unix, Scala, Spark, SQL, AWS, Spark in Scala The ideal candidate will have expertise in Scala, Spark, Spark in Scala, AWS, SQL, and Unix.This role involves analyzing business requirements, developing data solutions, and ensuring seamless integration with our existing systems.The candidate will play a crucial role in driving data-driven decision-making processes within the organization.Roles & ResponsibilitiesAnalyze and interpret complex business requirements to develop effective data solutions.Collaborate with cross-functional teams to gather and document business requirements.Develop and maintain scalable data pipelines using Scala and Spark.Implement data processing workflows using Spark in Scala to ensure efficient data handling.Utilize AWS services to deploy and manage data solutions in a cloud environment.Write and optimize SQL queries to extract and manipulate data from various databases.Ensure data integrity and accuracy through rigorous testing and validation processes.Monitor and troubleshoot data pipelines to ensure seamless operation and minimal downtime.Provide insights and recommendations based on data analysis to support business decision-making.Create and maintain detailed documentation for data solutions and workflows.Collaborate with stakeholders to understand their data needs and provide appropriate solutions.Stay updated with the latest industry trends and technologies to continuously improve data solutions.Contribute to the overall data strategy and roadmap of the organization.QualificationsPossess a strong understanding of Scala, Spark, and Spark in Scala for data processing.Demonstrate proficiency in AWS services for deploying and managing data solutions.Exhibit expertise in writing and optimizing SQL queries for data extraction and manipulation.Show experience in Unix for managing and automating data workflows.Have excellent analytical and problem-solving skills to interpret complex business requirements.Display strong communication skills to collaborate effectively with cross-functional teams.Be detail-oriented with a focus on ensuring data accuracy and integrity.Show a proactive approach to staying updated with the latest industry trends and technologies.Demonstrate the ability to create and maintain detailed documentation for data solutions. Regards, Elender Poosa | Tekgence IncCell: 469-663-0449Email: elender@tekgence.com | Website: www.tekgence.com6655 Deseo Dr • Suite 104 • Irving, TX • 75039\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "63_Senior SDK Architect": "David,\nFluxtek solutions\ndavid@fluxteksol.com\nReply to: david@fluxteksol.com\nJob Title: Senior SDK Architect (Software Development Kit Architect )Location: Houston, TXDuration: Long Term Skills:Docker: Extensive experience with Docker for containerization.Linux: Strong proficiency in Linux operating systems.Kubernetes: Advanced knowledge of Kubernetes for container orchestration.DevOps: Deep understanding of DevOps principles and practices.Azure: Proficiency in Microsoft Azure cloud services.Version Control: Expert in using Git for version control.DBMS: Experience with various Database Management Systems (e.g., MySQL, PostgreSQL, MongoDB).Messaging Services: Experience with messaging services such as RabbitMQ, Apache Kafka, or Azure Service Bus.Logging Services: Proficiency in logging services and tools like ELK Stack (Elasticsearch, Logstash, Kibana) or Grafana Loki.Python: Proficiency in Python for scripting, automation, and building scalable applications.Hardware Acceleration: Knowledge in hardware acceleration technologies such as CUDA, ROCm, and similar frameworks for enhancing computational performance.APIs & Microservices: Strong knowledge of designing, developing, and managing RESTful APIs and microservices architecture.Security: In-depth knowledge of security best practices and implementations.Preferred Additional Skills:MLOps: Familiarity with MLOps practices and tools such as MLflow, Kubeflow, and TFX.AI App Deployment: Experience with deploying AI applications using frameworks like CUDA, ROCm, TensorFlow, or PyTorch.CI/CD: Proficient in setting up and managing continuous integration and continuous deployment pipelines using Jenkins, GitLab CI, or CircleCI.Infrastructure as Code (IaC): Experience with tools like Terraform, Ansible, or Pulumi.Networking: Solid understanding of networking concepts and protocols, including SDN and VPN configurations.Distributed Computing: Familiar with technologies like Apache Kafka, Apache Spark, and Hadoop. Agile/Scrum: Experience working in Agile or Scrum development environments.Serverless Architectures: Knowledge of serverless computing and frameworks such as AWS Lambda, Azure Functions, or Google Cloud Functions.Performance Optimization: Techniques for optimizing system performance, including load balancing with NGINX or HAProxy, and caching with Redis or Memcached.Experience:7+ years of experience in systems architecture and related fields.Proven track record of designing and implementing scalable and robust systems.Experience in leading and mentoring engineering teams.Advanced (B2) English skills.Preferred Qualifications:Bachelor’s degree in Computer Science, Information Technology, or a related field.Certifications in relevant technologies (e.g., Docker, Kubernetes, Azure).Responsibilities:Design and implement scalable, secure, and reliable systems architecture.Lead and mentor a team of engineers to ensure successful project delivery.Collaborate with cross-functional teams to define system requirements and specifications.Implement and manage containerization and orchestration using Docker and Kubernetes.Optimize system performance and ensure high availability.Develop and maintain CI/CD pipelines for efficient software delivery.Ensure adherence to security best practices across all systems.Stay current with emerging trends and technologies in systems architecture and DevOps.Troubleshoot and resolve issues related to system performance, security, and scalability.Document system designs, processes, and configurations for knowledge sharing and compliance. Warm RegardsDavidUS IT RecruitingFluxtek Solution IncEmail : david@fluxteksol.com\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "64_Multiple requirement": "Ajay Kumar,\nDelta System & Software, Inc.\najay.kumar@delta-ssi.net\nReply to: ajay.kumar@delta-ssi.net\nHi,We have urgent requirements for following contract opportunities with our Client. Please send a resume of suitable candidates, with best bill rates and availability and contact information. 1st Requirement Role: Windchill Integration LeadLocation: RemoteDuration- 12 MonthsSkills:Work with Solution Architect(s) in the software selection for the integration architecture components.Work with the Application Lead(s) to define a high-level design of an end-to-end integration solution by:Identifying the flow of data between the applications that must be integrated.Mapping business process activities to the applications that support them.Drafting a data object model that provides a common structure for mapping the data between the applications.Analyze the use cases and system data flow diagrams to identify any additional integration requirements.Create an inventory of all cross-application interactions or interfaces.Work closely with the Business Analysts to confirm the integration requirements identified.Identify cross-team issues and communicate them to the appropriate team leads.Validate that the application requirements meet overall business process needs, are within the project scope, and are internally consistent.Validate that the integration solution and integration architecture designs utilize the integration architecture components appropriately.Solid experience in defining the applications landscape including integrations to implement overall functional/business capabilities.Expertise to define a high-level design of an end-to-end integration solution including dataflow between the interfacing applications.Ability to use the business process design to drive out the full set of application requirements: functional, quality, integration, and security.Assess the impact of the integration requirements to the architecture and specify the integration service requirements.Validate that configuration and development effort is meeting practices and standards. 2nd RequirementPosition- Brave Technology Architect with AWSLocation – Remote Duration- 12 Months contract 1. Terraform Template creation 2. Terraform module write up 3. AWS Resources including Gateway, Lambda, Authentication pattern 4. Helm template 5. Python or Shell scripting, Bash scripting 6. Python development 7. Github, Github action includes Scans like Sonar, AppSec 8. Branching strategy 9. GitOps 10. Python API development 11. Experience in DevOps Architecture design and strategy. 12. how deploy same authentication in Lambda and EKS 13. Server less authentication services 3rd Requirement SAP HCM/SuccessFactors (SF)/ABAP, Integration DeveloperDuration: 6 Months+Location: Remote (must live in USA) - Strong SAP ERP HCM and SAP SuccessFactors Talent Solutions Integration experience using Talent Hybrid Integration add-on- Strong expertise in Integration design and development using SAP Integration Suite for SF RCM, SF ONB 2.0, and SAP ERP HCM solutions- Strong experience in groovy scripting and web services-based interfaces- Strong experience in SAP SuccessFactors APIs and ERP HCM Integration Patterns- Good understanding of SF RCM, SF ONB 2.0 modules- Strong ABAP Development experience in SAP HCM- Strong experience in PA and OM modules in SAP HCM- Strong expertise in BIB Replication setup from SAP ERP HCM to SF EC- Good experience in creating Unit Test Cases for Integration- Good experience in creating Integration Design and technical specification documents 4th Requirement SAP HCM/SuccessFactors (SF), Integration ConsultantDuration: 6 Months (Part-time 16 Hours/week)Location: Remote (must live in US/Canada) At a high level, there are two further design iterations and one SIT/UAT cycle remaining and some of the additional services required in this change order are: Time Management Processes in Scope Include:• Time Entry• Positive Time Recording• Short Term Leave• Long Term Leave SAP SF HCM Solutions/Modules in Scope Include:• SF Employee Central Time• SF Employee Central Time Off• SF Employee Central Time Off For Leave of Absence Retrofit the current population live on LOA as a generic time profile for Leave of Absences to be configured as a time type in order to bring in the current LOA process. Time Off & Time Timesheet Population in U.S. - includes Salaried Employees that are: Full time: Exempt & Non-Exempt Employees, Part time: Employees, Interns & Students Thanks and Regards,Ajay KumarDelta System & Software, Inc.3721 S. Stonebridge Dr, Suite 301McKinney, TX – 75070ajay.kumar@delta-ssi.net\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "65_Spark Developer with Java background": "Ravi Duvey,\nTek Inspirations LLC\nravi.duvey@tekinspirations.com\nReply to: ravi.duvey@tekinspirations.com\nJob Description -Title : Spark Developer with Java backgroundType : OnsiteLocation : Mclean, VAMOI : Skype Passport no is compulsory for submissionWe are currently seeking a candidate for \"Spark developer\" for Contact position.Job descriptionYour expertise in Python, PySpark, processes, CI/CD (Jenkins or GitHub), and experience with both streaming and batch workflows will be essential in ensuring the efficient flow and processing of data to support our clientsCollaborate with cross-functional teams to understand data requirements and design robust data architecture solutionsImplement ETL processes to extract, transform, and load data from various sourcesEnsure data quality, integrity, and consistency throughout the ETL pipelineUtilize your expertise in Python and PySpark to develop efficient data processing and analysis scriptsOptimize code for performance and scalability, keeping up-to-date with the latest industry best practicesIntegrate data from different systems and sources to provide a unified view for analytical purposesCollaborate with data analysts to implement solutions that meet their data integration needsDesign and implement streaming workflows using PySpark Streaming or other relevant technologiesDevelop batch processing workflows for large-scale data processing and analysis\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "67_We are looking for Python Fullstack Developer in Remote.": "JAY,\nSN Cloud Solutions LLC\njay@sncloudsolutions.com\nReply to: jay@sncloudsolutions.com\nTitle: Python Fullstack DeveloperLocation: RemoteDuration: 12 Month(s) We are looking for an experienced Senior Full Stack Python & React Developer to lead the design, development, and implementation of scalable web applications and strong expertise in App Security. The ideal candidate will have a strong background in both Python with AWS lambda and React, with a passion for delivering high-quality software solutions that meet business requirements. This role offers the opportunity to work on exciting projects, collaborate with cross-functional teams, and drive innovation in a fast-paced environment. Key Responsibilities: 1.Design, develop, and maintain robust and scalable web applications using Python with serverless architecture and React. 2.Collaborate with product managers, designers, and other stakeholders to define project requirements and deliverables. 3.Strong understanding of security principles, protocols, and standards (e.g., OWASP, TLS/SSL, encryption). 4.Lead technical discussions and provide guidance to junior developers on best practices and code quality. 5.Participate in code reviews to ensure adherence to coding standards, scalability, and performance requirements. 6.Identify and address technical debt, performance bottlenecks, and other software issues. 7.Stay current with emerging technologies and trends in web development, and propose new solutions and frameworks to improve efficiency and productivity. 8.Work closely with QA engineers to ensure the quality and reliability of the software through comprehensive testing and validation. 9.Provide technical support and troubleshooting for production issues as needed. Qualifications: 1.Bachelor's degree in Computer Science, Engineering, or related field 2.5+ years of professional experience in software development, with a focus on full stack web development. 3.Proficiency in Python, AWS Lambda for backend development. 4.Proficiency in secure coding practices and vulnerability management. 5.Strong experience with React.js and related libraries/tools (Redux, Hooks) for frontend development. 6.Solid understanding of RESTful APIs, JSON/XML, and web services integration. 7.Experience with database design and optimization (SQL Server/ PostgreSQL). 8.Familiarity with modern web technologies such as HTML5, CSS3, JavaScript ES6+, and responsive design principles. 9.Experience with Agile/Scrum methodologies and version control systems (Git, SVN, etc.). 10.Excellent problem-solving skills and attention to detail 11.Strong communication and interpersonal skills, with the ability to collaborate effectively in a team environment. Qualifications Needed: 1.Familiarity with AWS services such as API Gateway, DynamoDB, and S3 2.Familiarity with DevOps practices and tools (Jenkins, Azure DevOps) 3.Familiarity with unit testing frameworks like Behave, Cucumber, Jest, etc., 4.Experience with security testing tools and techniques (e.g., penetration testing, static code analysis) 5.Familiarity with security compliance frameworks (e.g., GDPR, HIPAA, SOC 2). 6.Experience with AWS security services such as IAM, KMS, and AWS Config. Thank you,JaySN Cloud Solutions LLC USA +1 972 327 7306 Email: Jay@sncloudsolutions.com\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "68_Frontend React Developer Any visa is fine": "Suresh,\nTech Rakers\nsureshk@techrakers.com\nReply to: sureshk@techrakers.com\nTitle: Frontend React DeveloperLocation: Boston, MADuration: 6+ MonthsRequired:Basic Qualifications:Bachelor’s Degree4+ years of professional software engineering experience (Internship experience does not apply)4+ years of experience with one of the following: React, Angular, or VuePreferred Qualifications:6+ years of experience with the following: JavaScript/TypeScript, React, and Node1+ years of experience with AWS, GCP, Azure, or another cloud service1+ years of experience with Python or Java3+ years of experience in open source frameworks2+ years of experience in Agile practices Thanks and regards,Suresh Kumar,sureshk@techrakers.com\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "70_Hiring Now :Python Full Stack Architect : NYC, NY": "Lipsa Mohanty,\nAdventa Tech Inc.\nlipsa@adventatech.com\nReply to: lipsa@adventatech.com\nJob Title: Python Full Stack Architect Location: Onsite -NYC, NY Duration: 6 month (C2H)Visa: No H1B / OPTMOI: SkypeJOB DESCRIPTIONMandatory skills : Architect- Python Lamba - React - Dynamo DB - Vulnerability - Mix - AWS - Backend - Secuirty Healthcare back ground must Senior Full Stack Python & React Developer to lead the design, development, and implementation of scalable web applications and strong expertise in App Security. strong background in both Python with AWS lambda and React, with a passion for delivering high- Quality software solutions that meet business requirements. This role offers the opportunity to work on exciting projects, collaborate with cross-functional teams, and drive innovation in a fast-paced environment. Key Responsibilities: 1.Design, develop, and maintain robust and scalable web applications using Python with serverless architecture and React. 2.Collaborate with product managers, designers, and other stakeholders to define project requirements and deliverables. 3.Strong understanding of security principles, protocols, and standards (e.g., OWASP, TLS/SSL, encryption). 4.Lead technical discussions and provide guidance to junior developers on best practices and code quality. 5.Participate in code reviews to ensure adherence to coding standards, scalability, and performance requirements. 6.Identify and address technical debt, performance bottlenecks, and other software issues. 7.Stay current with emerging technologies and trends in web development, and propose new solutions and frameworks to improve efficiency and productivity. 8.Work closely with QA engineers to ensure the quality and reliability of the software through comprehensive testing and validation. 9.Provide technical support and troubleshooting for production issues as needed. Qualifications: 1.Bachelor's degree in Computer Science, Engineering, or related field 2.5+ years of professional experience in software development, with a focus on full stack web development. 3.Proficiency in Python, AWS Lambda for backend development. 4.Proficiency in secure coding practices and vulnerability management. 5.Strong experience with React.js and related libraries/tools (Redux, Hooks) for frontend development. 6.Solid understanding of RESTful APIs, JSON/XML, and web services integration. 7.Experience with database design and optimization (SQL Server/ PostgreSQL). 8.Familiarity with modern web technologies such as HTML5, CSS3, JavaScript ES6+, and responsive design principles. 9.Experience with Agile/Scrum methodologies and version control systems (Git, SVN, etc.). 10.Excellent problem-solving skills and attention to detail 11.Strong communication and interpersonal skills, with the ability to collaborate effectively in a team environment. Preferred Qualifications: 1.Familiarity with AWS services such as API Gateway, DynamoDB, and S3 2.Familiarity with DevOps practices and tools (Jenkins, Azure DevOps) 3.Familiarity with unit testing frameworks like Behave, Cucumber, Jest, etc., 4.Experience with security testing tools and techniques (e.g., penetration testing, static code analysis) 5.Familiarity with security compliance frameworks (e.g., GDPR, HIPAA, SOC 2). 6.Experience with AWS security services such as IAM, KMS, and AWS Config. Send candidates resume on :- lipsa'at'adventatech.com\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "72_Java AWS terraform - Wilmington, NY": "Priya,\nRcube Creative Consulting\npriya@rcubecreativeconsulting.com\nReply to: priya@rcubecreativeconsulting.com\nPrevious JPMC experience will be an added advantage. Extensive experience with AWS Cloud Provider and its services like, but not limited to - compute, networks, storage, databases, analytics. Extensive experience in Continuous Integration and Continuous Deployment techniques and tools like Jenkins, Spinnaker, Nexus, etc.Experienced in source code systems and branching strategies. Containerization technologies like Docker and its orchestration using Kubernetes Collaboration, tracking and documentation JIRA, Confluence Infrastructure provisioning using Infrastructure as a Code Terraform Application monitoring and logging - ELK, Grafana, Prometheus, AWS CloudWatch Networking concepts - Access Control Lists, Bastion Hosts, Reverse Proxies, Forward Proxies, Load balancing One or more programming or scripting languages like Shell, Python, Java, Groovy Configuration Management Chef Ansible We advocate cloud platform security and hence you should have experience familiarity with Cloud Network security Secure SDLC practices Data security Authentication and Authorization Web Application Firewall Application workload security using hardening methodologies, vulnerability scanning A good understanding of distributed systems and microservices\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "73_Embedded Software engineer - REMOTE": "Raghuteja,\nW3Global\nraghu.miriyala@w3global.com\nReply to: raghu.miriyala@w3global.com\nJob : Embedded Software EngineerLocation : RemoteTraining Location : Oneonta, NY Needs are:C, C++, PythonYocto OR IEC 61850 ExperienceHardware and Software ExperienceJob Description:Position Overview: We are seeking a skilled and motivated Embedded Software Developer to join our dynamic team. This role is crucial to the design and development of our next-generation energy storage products. The ideal candidate will have a robust background in embedded systems and will be instrumental in creating software that integrates seamlessly with our hardware solutions.Key Responsibilities:Design, develop, test, and maintain embedded software for new and existing products in the energy storage space.Write, debug, and optimize code primarily in the C programming language, with additional development in Python.Work within Linux and Windows environments to develop software solutions.Develop custom Layer 3 (L3) communication protocols to ensure efficient and secure data exchange between systems.Implement SecDevOps practices to integrate security into all stages of software development.Ensure the cybersecurity of our products by implementing secure code storage practices and conducting regular security assessments.Design and integrate Human-Machine Interface (HMI) and Supervisory Control and Data Acquisition (SCADA) systems for monitoring and control.Utilize version control systems to manage and track changes to the software codebase.Collaborate closely with hardware engineers to integrate and troubleshoot embedded software.Provide technical documentation and support to ensure comprehensive understanding of the software solutions.Qualifications:Bachelor's degree in Computer Science, Electrical Engineering, or a related field. A Master’s degree or equivalent experience is a plus.5-7 years of hands-on experience in embedded software development.Proficiency in C/C++ programming language; experience with Python is highly desirable.Solid understanding of Linux and Windows operating systems for embedded development.Experience in developing custom L3 communication protocols.Familiarity with SecDevOps practices and a strong focus on integrating security into software development.Knowledge of cybersecurity principles and secure code storage methodologies.Experience with HMI/SCADA systems development.Proficiency with version control systems such as Git.Strong problem-solving skills and the ability to work independently or as part of a team.Excellent communication skills and the ability to document and explain complex technical concepts.Preferred Skills:Background in electrical engineering or experience in the energy storage industry.Proficiency with agile development methodologies.Familiarity with the Yocto Project or other custom Linux build toolsUnderstanding of IEC 61850 protocolsExperience leading projects/teamsKnowledge of other programming languages and tools related to embedded systems development.Why Join Us:Be a part of a leading company in the energy storage sector, contributing to innovative and sustainable solutions.Work with a passionate and collaborative team of professionals.Opportunities for professional growth and career advancement.Competitive salary and comprehensive benefits package.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "74_Java Full Stack Developer| Waukesha, WI | LOCAL ONLY": "Deepak Kumar,\nKlaxontech Inc.\ndeepak.k@klaxontech.com\nReply to: deepak.k@klaxontech.com\nPosition: Java Full Stack (Java & Angular)Location: Waukesha, WI (Onsite)Exp: 5-7 Years Any Visa But No H1BLocal Candidates only (there will be F2F interview) Essential Job FunctionsSoftware design and development of applications and frameworks using Core Java, Spring Boot, other Java technologies and Angular UIUnderstand / learn architecture and design of existing enterprise applications developed mainly using Core Java and Angular, but also having understanding in Linux, Scripting, Perl / Python)Technical communication with internal and external stake holders and collaborate with global team.Required Skills:6 to 10 years of experience in design and development of software applications and frameworks using Core Java, Spring Boot and Angular with LinuxGood understanding of HTML, CSS, JavaScript, JavaScript frameworks and good hands on with Angular 2+ UI developmentGood understanding microservices Architecture and hands on experience with Kubernetes, Docker, Spring Boot in a Microservices environmentGood hands-on experience in unit test frameworks and writing unit test cases using Junit, BDD, CucumberUnderstanding of Swagger / Open APIUnderstanding of CI / CD pipelines like Jenkins and source control tools like Git or similarShould be able to understand / learn architecture and design of existing enterprise applications developed mainly using Core Java and Angular, but also having understanding in Linux, Scripting, Perl / Python)Good understanding of web servers, deployment, and hosting of web applications.Technical communication with internal and external stake holders and collaborate with global team.Good understanding of Linux and Linux scripting / PythonGood knowledge in Medical Devices, Healthcare or Devices domain experienceExcellent analytical, problem solving and debugging skills. QualificationsBachelor's Degree in Computer Science of Equivalent Engineering Degree Best Regards, Deepak KumarUS IT RecruiterE: deepak.k@klaxontech.comA: Klaxontech Inc, 14 Wall St, Suite 2061 New York NY, 10005www.klaxontech.com\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "75_Java Full Stack Tech with React    Plano TX -  Local only": "Asim,\nIntellicept\naahamed@intellicept.com\nReply to: aahamed@intellicept.com\nJava Full Stack Tech with React – 10 years expPlano, TX Front-End Skills:1. HTML/CSSa. Proficient in HTML 5, CSS3, JSXb. Experience with responsive design2. JavaScripta. Strong understanding on JavaScriptb. Experience with Framework/ libraries: Reactc. Familiarity with the state management: Reduxd. Basic knowledge of front-end build tools: Webpack, BableBack-End Skills:1. Service-side Languagesa. Proficiency in Javab. Experience with framework: Spring Boot /Spring Batch(Java 8 and above)c. Reactive Programming2. Database Managementa. Knowledge of SQL database: (e.g., MySQL)b. Basic understanding of database design and query optimization.3. API Developmenta. Experience in designing and developing RESTful APIs.b. Familiarity with authentication mechanismc. Knowledge on Messaging System (Apache Kafka)DevOps and Tools1. Version Controla. Proficiency with Git and Platforms like GitHub2. CI/CD and Deploymenta. Basic knowledge of CI/CD tools: (e.g., Jenkins)b. Familiarity with containerization using Docker.3. Cloud Servicesa. Basic experience with AWS.Soft Skills1. Problem-Solving : Ability to analyze and solve complex problems2. Communication: Effective communication skills3. Collaboration: Ability to work well in a team4. Team Handling: Experience in managing teamsProject Management: Familiarity with Agile MethodologyTools and Technologies:• IDEs: VS code, IntelliJ IDEA.• Package Managers : npm• Testing : Jest(JavaScript), Cypress (primarily used for end-to-end testing)• API testing: Postman• Issue tracking: JIRA,• Test management: Qtest• Log Management tool: Kibana• Monitoring Tools: Prometheus, Grafana\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists.",
    "76_Pyspark Developer || New York || Wilmington DE || Day 1 Onsite": "Ravi,\nXforia\nravi.vr@xforia.com\nReply to: ravi.vr@xforia.com\nTitle: Pyspark Developer Duration: ContractLocation: New York / Wilmington, DE - Day 1 Onsite Experience in building Spark Streaming process. Proficient in understanding distributed computing principles.Experience in managing Hadoop cluster with all services.Experience with Nosql Databases and Messaging systems like Kafka.Designing building installing configuring and supporting Hadoop Perform analysis of vast data stores.Good understanding of cloud technology.Must have strong technical experience in Design Mapping specifications HLD LLD.Must have the ability to relate to both business and technical members of the team and possess excellent communication skills.Leverage internal tools and SDKs, utilize AWS services such as S3, Athena, and Glue, and integrate with our internal Archival Service Platform for efficient data purging.Lead the integration efforts with the internal Archival Service Platform for seamless data purging and lifecycle management.Collaborate with the data engineering team to continuously improve data integration pipelines, ensuring adaptability to evolving business needs.\nSign-Up for your account with PROHIRES POWERHOUSE Recruiting Portal to broadcast requirements & hotlists."
}